{
    "Only free weights gym": {
        "Leg day": {
            "Squats": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell across your upper back with an overhand grip. Lower your body by bending your knees and hips, keeping your chest up and back straight, until your thighs are parallel to the floor, then push through your heels to return to the starting position. Focus on engaging your core and maintaining proper alignment to target the quadriceps, hamstrings, and glutes effectively. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand at your sides. Step forward with one leg, lowering your hips until both knees are bent at about a 90-degree angle, ensuring the front knee is directly above the ankle. Push through the heel of the front foot to return to the starting position, focusing on engaging the quadriceps, hamstrings, and glutes. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Deadlifts": {
                "Equipment": "Barbell",
                "Description": "Stand with feet hip-width apart, barbell over mid-foot, and grip it with hands just outside knees. Keep your back straight, engage your core, and lift the barbell by extending hips and knees simultaneously, keeping it close to your body. Focus on maintaining a neutral spine and engaging glutes, hamstrings, and lower back throughout the movement. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Glutes, Hamstrings, Lower Back"
            },
            "Bulgarian Split Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with one foot elevated on a bench behind you and hold a dumbbell in each hand at your sides. Lower your body by bending the front knee until the thigh is parallel to the ground, keeping your chest upright and core engaged, then push through the front heel to return to the starting position. Focus on maintaining balance and control to effectively target the quadriceps, glutes, and hamstrings. \n\nDescription",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Hamstrings"
            },
            "Romanian Deadlifts": {
                "Equipment": "Barbell",
                "Description": "Begin with feet hip-width apart, holding a barbell with an overhand grip in front of your thighs. Keeping your back straight and knees slightly bent, hinge at the hips to lower the barbell along your legs until you feel a stretch in your hamstrings, then return to the starting position by driving your hips forward. Focus on engaging the hamstrings and glutes throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Hamstrings, Glutes, Lower Back"
            },
            "Step-Ups": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with a dumbbell in each hand, arms at your sides, and feet shoulder-width apart. Step one foot onto a sturdy bench or platform, pressing through the heel to lift your body up, bringing the opposite knee up to a 90-degree angle. Lower back down with control, alternating legs, focusing on engaging the quadriceps, hamstrings, and glutes. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Box Jumps": {
                "Equipment": "Plyo box",
                "Description": "Stand with feet shoulder-width apart, facing the plyo box. Bend your knees slightly, swing your arms, and explosively jump onto the box, landing softly with knees slightly bent. Step back down carefully to starting position, focusing on engaging your core and leg muscles throughout. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Glutes, Calves, Core"
            },
            "Calf Raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand at your sides. Slowly raise your heels off the ground, balancing on the balls of your feet, and then lower back down with control. Focus on engaging your calf muscles throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Calves"
            },
            "Goblet Squats": {
                "Equipment": "Kettlebells",
                "Description": "Stand with feet shoulder-width apart, holding a kettlebell close to your chest with both hands. Lower your body into a squat by bending your knees and pushing your hips back, keeping your chest up and core engaged. Return to the starting position by driving through your heels, focusing on your quadriceps, glutes, and core. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Quadriceps, Glutes, Core"
            },
            "Glute Bridge": {
                "Equipment": "Dumbbells",
                "Description": "Lie on your back with knees bent and feet flat on the floor, holding a dumbbell on your hips. Engage your core and glutes, then lift your hips towards the ceiling until your body forms a straight line from shoulders to knees, squeezing your glutes at the top. Lower back down with control, ensuring your feet remain flat and your knees stay aligned with your hips. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hamstrings, Core"
            },
            "Reverse Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand at your sides. Step one foot back into a lunge, lowering your hips until both knees are bent at about a 90-degree angle, ensuring the front knee stays aligned over the ankle. Push through the heel of the front foot to return to the starting position, focusing on engaging the glutes and quadriceps. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Glutes, Hamstrings"
            },
            "Sumo Deadlifts": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet wider than shoulder-width apart, toes slightly pointed out, holding a dumbbell in each hand with arms extended. Lower the dumbbells by bending your knees and hips, keeping your back straight and chest up, until the dumbbells are just above the floor. Push through your heels to return to the starting position, focusing on engaging your glutes and inner thighs. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Glutes, Inner Thighs, Hamstrings, Lower Back"
            },
            "Single-Leg Romanian Deadlifts": {
                "Equipment": "Barbell",
                "Description": "Stand upright holding a barbell with both hands, feet hip-width apart. Shift your weight onto one leg, hinge at the hips, and lower the barbell towards the ground while extending the opposite leg straight back, keeping your back flat and core engaged. Return to the starting position by driving through the heel of the standing leg, focusing on the hamstrings and glutes. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Hamstrings, Glutes, Core"
            },
            "Pistol Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright holding a dumbbell in each hand, arms at your sides. Extend one leg forward and lower your body into a squat on the opposite leg, keeping your chest up and core engaged. Push through the heel of the standing leg to return to the starting position, focusing on balance and control throughout the movement. ",
                "Intensity": "8",
                "Difficulty": "8",
                "Muscles": "Quadriceps, Glutes, Hamstrings, Core"
            },
            "Curtsy Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand at your sides. Step your right leg behind and across your left leg, bending both knees to lower your body into a lunge, ensuring your front knee aligns over your ankle. Push through your front heel to return to the starting position, and repeat on the opposite side, focusing on engaging your glutes and inner thighs. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Glutes, Quadriceps, Inner Thighs"
            },
            "Walking Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Begin standing with feet hip-width apart, holding a dumbbell in each hand at your sides. Step forward with your right foot, lowering your hips until both knees are bent at a 90-degree angle, ensuring your front knee is directly above your ankle. Push through your right heel to return to standing and repeat with the left leg, maintaining an upright torso throughout. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Calves"
            },
            "Jump Squats": {
                "Equipment": "Bodyweight",
                "Description": "Start in a standing position with feet shoulder-width apart, lower into a squat by bending your knees and pushing your hips back, then explosively jump up, extending your arms overhead. Land softly back into the squat position, ensuring your knees are aligned with your toes and your core is engaged throughout the movement. Focus on maintaining a controlled descent and a powerful jump to effectively target the quadriceps, hamstrings, glutes, and calves. \n\nDescription",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Calves"
            },
            "Side Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in each hand at your sides. Step your right foot out to the side, bending your right knee while keeping your left leg straight, and lower the dumbbells towards the floor. Push through your right heel to return to the starting position, then repeat on the left side, focusing on engaging your glutes and inner thighs. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Glutes, Quadriceps, Inner Thighs"
            },
            "Single-Leg Squats": {
                "Equipment": "Barbell",
                "Description": "Stand with feet hip-width apart, holding a barbell across your upper back. Lift one leg off the ground and squat down on the standing leg, keeping your chest up and core engaged, then return to the starting position. Focus on maintaining balance and control to target the quadriceps, glutes, and core. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Quadriceps, Glutes, Core"
            },
            "Donkey Kicks": {
                "Equipment": "Ankle weights",
                "Description": "Begin on all fours with your hands under your shoulders and knees under your hips, wearing ankle weights. Keeping your knee bent at 90 degrees, lift one leg towards the ceiling, engaging your glutes and core, then lower it back without touching the ground. Focus on controlled movements to maximize glute activation and maintain a neutral spine throughout. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hamstrings, Core"
            },
            "Fire Hydrants": {
                "Equipment": "Ankle weights",
                "Description": "Begin on all fours with your hands under your shoulders and knees under your hips, wearing ankle weights. Keeping your knee bent at 90 degrees, lift one leg out to the side until your thigh is parallel to the ground, then lower it back down without touching the floor. Focus on engaging your glutes and core throughout the movement to maintain stability. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hip Abductors, Core"
            },
            "Hip Thrusts": {
                "Equipment": "Barbell",
                "Description": "Begin seated on the ground with your upper back resting against a bench, feet flat on the floor, and a barbell positioned over your hips. Drive through your heels to lift your hips until your body forms a straight line from shoulders to knees, squeezing your glutes at the top. Ensure your chin is tucked and core engaged throughout the movement to target the glutes effectively. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Glutes, Hamstrings, Quadriceps"
            },
            "Kettlebell Swings": {
                "Equipment": "Kettlebells",
                "Description": "Begin with feet shoulder-width apart, holding the kettlebell with both hands in front of you. Hinge at the hips, slightly bending your knees, and swing the kettlebell back between your legs, then thrust your hips forward to swing it up to shoulder height, keeping your arms straight. Focus on engaging your core and glutes, ensuring the power comes from your hips, not your arms. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core, Shoulders"
            },
            "Cossack Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet wider than shoulder-width apart, holding a dumbbell in each hand at your sides. Shift your weight to one leg, bending the knee and lowering your hips while keeping the other leg straight, then return to the starting position and repeat on the opposite side. Focus on engaging the glutes, quads, and inner thighs while maintaining an upright torso. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Glutes, Quads, Inner Thighs"
            },
            "Plie Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet wider than shoulder-width apart, toes pointing outwards, and hold a dumbbell with both hands in front of your chest. Lower your body by bending your knees and pushing your hips back, keeping your chest up and core engaged, until your thighs are parallel to the floor. Press through your heels to return to the starting position, focusing on engaging your inner thighs and glutes. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Glutes, Inner Thighs"
            },
            "Bear Crawls": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a tabletop position with hands under shoulders and knees under hips, hovering slightly above the ground. Move forward by simultaneously stepping your right hand and left foot, then your left hand and right foot, keeping your back flat and core engaged. Focus on maintaining a steady pace and controlled movements to engage the shoulders, core, and legs effectively. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Shoulders, Core, Quadriceps"
            },
            "Russian Twists": {
                "Equipment": "Medicine ball",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a medicine ball with both hands. Lean back slightly, keeping your back straight, and lift your feet off the ground. Rotate your torso to the right, bringing the medicine ball beside your hip, then twist to the left, engaging your core throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Mountain Climbers": {
                "Equipment": "Bodyweight",
                "Description": "Start in a high plank position with your hands directly under your shoulders and your body forming a straight line from head to heels. Quickly drive your knees alternately towards your chest, maintaining a brisk pace while keeping your core engaged and hips level. Focus on maintaining proper form to target the core, shoulders, and legs effectively. ",
                "Intensity": "7",
                "Difficulty": "4",
                "Muscles": "Core, Shoulders, Legs"
            },
            "Plank Leg Lifts": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standard plank position with your forearms on the ground and body in a straight line from head to heels. Engage your core and glutes, then lift one leg off the ground, keeping it straight and in line with your body, hold briefly, and lower it back down before switching legs. Focus on maintaining a stable core and avoiding any hip rotation throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Core, Glutes, Shoulders"
            },
            "Jump Lunges": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standing position with feet hip-width apart, then step forward into a lunge, ensuring your front knee is aligned over your ankle. Explosively jump, switching legs mid-air, and land softly in a lunge with the opposite leg forward, maintaining a straight torso throughout. Focus on engaging your quadriceps, hamstrings, and glutes for stability and power. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Wall Sits": {
                "Equipment": "Bodyweight",
                "Description": "Stand with your back against a wall, feet shoulder-width apart and about two feet away from the wall. Slide down the wall until your knees are at a 90-degree angle, keeping your back flat against the wall and your core engaged. Hold this position, ensuring your knees do not extend past your toes, to target the quadriceps, hamstrings, and glutes. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Side Plank Leg Raises": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a side plank position with your elbow directly under your shoulder and your body in a straight line. Engage your core and lift your top leg as high as possible while keeping your hips elevated and stable, then lower it back down with control. Focus on maintaining balance and engaging your obliques and glutes throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Obliques, Glutes, Hip Abductors"
            },
            "Walking Plank": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a high plank position with your hands directly under your shoulders and your body in a straight line from head to heels. Lower one forearm to the ground, followed by the other, transitioning into a forearm plank, then return to the high plank position by placing one hand back on the ground at a time. Focus on keeping your core engaged and hips stable throughout the movement to effectively target the core, shoulders, and triceps. \n\nDescription",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Core, Shoulders, Triceps"
            },
            "Skater Lunges": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standing position with feet hip-width apart. Leap laterally to the right, landing on your right foot while sweeping your left leg behind you, bending your right knee into a lunge. Push off your right foot to leap to the left, repeating the motion on the opposite side, focusing on balance and engaging your glutes, quads, and core. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Glutes, Quads, Core"
            },
            "Frog Jumps": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a squat position with feet shoulder-width apart, toes slightly turned out, and hands touching the ground in front of you. Explosively jump forward, extending your legs and swinging your arms back, landing softly back into the squat position. Focus on engaging your quadriceps, glutes, and calves throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Glutes, Calves"
            },
            "Scissor Kicks": {
                "Equipment": "Bodyweight",
                "Description": "Lie on your back with your hands under your glutes for support, legs extended. Lift both legs off the ground slightly, then alternate crossing one leg over the other in a scissor-like motion, keeping your core engaged and lower back pressed into the floor. Focus on controlled movements to target the lower abs and hip flexors. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Lower abs, hip flexors"
            },
            "High Knees": {
                "Equipment": "Bodyweight",
                "Description": "Stand tall with feet hip-width apart, engage your core, and lift one knee towards your chest while simultaneously swinging the opposite arm forward. Quickly alternate legs, maintaining a brisk pace, ensuring your knees reach at least hip height to effectively engage the core and lower body muscles. Focus on maintaining an upright posture and landing softly on the balls of your feet to reduce impact. \n\nDescription",
                "Intensity": "6",
                "Difficulty": "3",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Calves, Core"
            },
            "Butt Kicks": {
                "Equipment": "Bodyweight",
                "Description": "Stand tall with feet hip-width apart, then jog in place while kicking your heels up towards your glutes. Keep your core engaged and maintain a brisk pace, focusing on a light landing to minimize impact. This exercise primarily targets the hamstrings and glutes. ",
                "Intensity": "3",
                "Difficulty": "2",
                "Muscles": "Hamstrings, Glutes"
            },
            "Squat Jumps": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standing position with feet shoulder-width apart, toes slightly pointed out, and hands at your sides. Lower into a squat by bending your knees and pushing your hips back, keeping your chest up, then explosively jump upwards, extending your arms overhead. Land softly back into the squat position, ensuring your knees are aligned with your toes to engage the quadriceps, hamstrings, and glutes effectively. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Reverse Hyperextensions": {
                "Equipment": "Bodyweight",
                "Description": "Lie face down on a bench with your hips at the edge, gripping the bench for support. Keeping your legs straight, lift them until they are in line with your torso, squeezing your glutes and lower back, then slowly lower them back down. Focus on controlled movements to engage the glutes, hamstrings, and lower back effectively. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hamstrings, Lower Back"
            },
            "Leg Presses": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Lower your body into a squat by bending your knees and hips, keeping your back straight and chest up, then push through your heels to return to standing. Focus on engaging your quadriceps, hamstrings, and glutes throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Leg Curls": {
                "Equipment": "Dumbbells",
                "Description": "Lie face down on a bench with a dumbbell secured between your feet, ensuring your knees are just off the edge. Keeping your hips pressed into the bench, curl the dumbbell towards your glutes by bending your knees, then slowly lower back to the starting position. Focus on engaging your hamstrings throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Hamstrings, Glutes"
            },
            "Hamstring Curls": {
                "Equipment": "Dumbbells",
                "Description": "Lie face down on a bench with a dumbbell secured between your feet, ensuring your legs are fully extended. Slowly curl the dumbbell towards your glutes by bending your knees, keeping your hips pressed against the bench, then lower back to the starting position. Focus on engaging your hamstrings throughout the movement, avoiding any swinging or jerking motions. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Hamstrings, Glutes"
            },
            "Front Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at shoulder height with palms facing inward. Lower your body by bending your knees and hips, keeping your chest up and core engaged, until your thighs are parallel to the floor, then push through your heels to return to the starting position. Focus on maintaining an upright torso and even weight distribution. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Glutes, Core"
            },
            "Zercher Squats": {
                "Equipment": "Barbell",
                "Description": "Begin by positioning the barbell in the crook of your elbows, standing with feet shoulder-width apart. Lower your body by bending at the hips and knees, keeping your chest upright and core engaged, until your thighs are parallel to the ground. Push through your heels to return to the starting position, focusing on maintaining a straight back throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Hamstrings, Core"
            },
            "Hack Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Lower your body by bending your knees and hips, keeping your back straight and chest up, until your thighs are parallel to the floor. Push through your heels to return to the starting position, focusing on engaging your quadriceps and glutes throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Glutes, Hamstrings"
            },
            "Split Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in each hand. Step one foot forward into a lunge position, ensuring the front knee aligns over the ankle and the back knee hovers just above the ground. Push through the front heel to return to standing, focusing on engaging the quadriceps and glutes. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Glutes, Hamstrings"
            },
            "Sissy Squats": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Keeping your torso straight, lean back slightly as you bend your knees, lowering your body while keeping your heels elevated and knees forward. Focus on engaging your quadriceps and maintaining balance throughout the movement. ",
                "Intensity": " 6 ",
                "Difficulty": " 5 ",
                "Muscles": " Quadriceps, Core, Calves"
            },
            "Good Mornings": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell across your upper back with a firm grip. Keeping your back straight and knees slightly bent, hinge at the hips to lower your torso until it's nearly parallel to the floor, then return to the starting position. Focus on engaging your hamstrings, glutes, and lower back throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Hamstrings, Glutes, Lower Back"
            },
            "Hip Abductions": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand. Lift one leg out to the side, keeping it straight and maintaining a slight bend in the standing leg, then return to the starting position. Focus on engaging the outer thighs and glutes while keeping your core stable. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Outer Thighs"
            },
            "Hip Adductions": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand. Shift your weight onto one leg and slowly lift the opposite leg across your body, keeping it straight, then return to the starting position. Focus on controlled movements to engage the inner thigh muscles effectively. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Adductors, Inner Thighs"
            },
            "Leg Extensions": {
                "Equipment": "Dumbbells",
                "Description": "Sit on a sturdy chair with your back straight and feet flat on the floor, holding a dumbbell between your feet. Slowly extend your legs until they are parallel to the floor, keeping your core engaged, then lower them back to the starting position. Focus on contracting your quadriceps throughout the movement for optimal results. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Quadriceps"
            },
            "Walking Squats": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standing position with feet shoulder-width apart, toes pointing slightly outward. Lower into a squat by bending your knees and pushing your hips back, keeping your chest up and core engaged. While maintaining the squat position, take small steps forward, ensuring knees stay aligned with toes and weight is distributed evenly across your feet. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Lateral Lunges": {
                "Equipment": "Bodyweight",
                "Description": "Stand with feet hip-width apart, then take a wide step to the side, bending the knee of the stepping leg while keeping the other leg straight. Lower your hips back and down, ensuring your knee stays aligned with your toes, then push back to the starting position. Focus on engaging your glutes, quads, and inner thighs throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Glutes, Quads, Inner Thighs"
            },
            "Single-Leg Deadlifts": {
                "Equipment": "Barbell",
                "Description": "Stand upright holding a barbell with both hands, feet hip-width apart. Shift your weight onto one leg, hinge at the hips, and lower the barbell towards the ground while extending the opposite leg straight behind you, keeping your back flat. Return to the starting position by engaging your glutes and hamstrings, ensuring your core remains tight throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Hamstrings, Glutes, Core"
            },
            "Incline Lunges": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in each hand. Step forward onto an incline with one foot, bending both knees to lower your body until the front thigh is parallel to the ground, ensuring the knee does not extend past the toes. Push through the front heel to return to the starting position, focusing on engaging the quadriceps, hamstrings, and glutes. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Seated Calf Raises": {
                "Equipment": "Dumbbells",
                "Description": "Sit on a bench with your feet flat on the floor, holding a dumbbell on each knee. Lift your heels by pressing through the balls of your feet, raising your knees and the dumbbells, then slowly lower back to the starting position. Focus on engaging the calf muscles throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Calves"
            },
            "Jumping Lunges": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a standing position with feet hip-width apart, then step forward into a lunge, ensuring the front knee is aligned over the ankle. Explosively jump, switching legs mid-air, and land softly in a lunge with the opposite leg forward, maintaining a straight torso and engaged core throughout. Focus on balance and control to effectively target the quadriceps, hamstrings, and glutes. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Lateral Band Walks": {
                "Equipment": "Resistance bands",
                "Description": "Begin by placing a resistance band around your legs, just above your knees. Stand with feet shoulder-width apart, knees slightly bent, and core engaged. Step laterally to the side, maintaining tension in the band, and then bring the other foot to meet it. Focus on keeping your hips level and knees aligned over your toes throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "3",
                "Muscles": "Glutes, Hip Abductors"
            },
            "Glute Kickbacks": {
                "Equipment": "Ankle weights",
                "Description": "Begin on all fours with your hands directly under your shoulders and knees under your hips, wearing ankle weights. Keeping your knee bent at 90 degrees, lift one leg up and back until your thigh is parallel to the ground, squeezing your glutes at the top. Lower the leg back to the starting position without touching the ground and repeat, focusing on engaging the glutes throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hamstrings"
            },
            "Toe Taps": {
                "Equipment": "Bodyweight",
                "Description": "Begin by lying on your back with your knees bent at a 90-degree angle and your shins parallel to the floor. Engage your core, and slowly lower one foot to tap the ground, then return to the starting position and repeat with the other foot, maintaining a controlled movement throughout. Focus on keeping your lower back pressed into the floor to effectively engage the abdominal muscles. ",
                "Intensity": "3",
                "Difficulty": "2",
                "Muscles": "Abdominals, Hip Flexors"
            },
            "Side Leg Raises": {
                "Equipment": "Ankle weights",
                "Description": "Stand upright with feet hip-width apart, wearing ankle weights. Shift your weight onto one leg and slowly lift the opposite leg to the side, keeping it straight and toes pointed forward. Focus on engaging the outer thigh and hip muscles, then lower the leg back to the starting position with control. ",
                "Intensity": "3",
                "Difficulty": "3",
                "Muscles": "Gluteus medius, hip abductors, outer thighs"
            },
            "Wall Sit Leg Extensions": {
                "Equipment": "Bodyweight",
                "Description": "Stand with your back against a wall and slide down into a squat position with thighs parallel to the ground. Extend one leg straight out in front of you, hold for a moment, then return to the starting position and switch legs. Focus on maintaining a strong core and keeping your back flat against the wall throughout the exercise. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Reverse Lunges with Twist": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet hip-width apart, holding a dumbbell in each hand at shoulder height. Step one foot back into a lunge, lowering your hips until both knees are bent at about 90 degrees, then twist your torso towards the front leg, engaging your core. Return to the starting position and repeat on the other side, ensuring your front knee stays aligned with your ankle. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Core, Obliques"
            },
            "Side Plank Leg Lifts": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a side plank position with your elbow directly under your shoulder and your body in a straight line. Engage your core and lift your top leg as high as possible while keeping your hips elevated and stable. Focus on maintaining balance and control throughout the movement to target the obliques, glutes, and abductors. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Glutes, Abductors"
            },
            "Single-Leg Hip Thrusts": {
                "Equipment": "Barbell",
                "Description": "Begin seated on the ground with your upper back against a bench, one foot flat on the floor, and the other leg extended. Place a barbell across your hips, then drive through the heel of the grounded foot to lift your hips until your body forms a straight line from shoulders to knees, focusing on engaging the glutes and hamstrings. Lower your hips back down with control and repeat, ensuring the barbell remains stable throughout the movement. \n\nDescription",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core"
            },
            "Side Lying Leg Lifts": {
                "Equipment": "Bodyweight",
                "Description": "Lie on your side with legs extended and stacked, supporting your head with your lower arm. Lift the top leg upwards while keeping it straight, then lower it back down with control, focusing on engaging the outer thigh and hip muscles. Ensure your core remains tight and your body aligned throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "2",
                "Muscles": "Gluteus medius, hip abductors, obliques"
            },
            "Single-Leg Squat Jumps": {
                "Equipment": "Barbell",
                "Description": "Begin by standing on one leg with a barbell resting across your upper back, ensuring your core is engaged and your chest is lifted. Lower into a squat on the standing leg, then explosively jump upwards, landing softly back into the squat position. Focus on maintaining balance and control throughout the movement to effectively target the quadriceps, hamstrings, glutes, and calves. ",
                "Intensity": "7",
                "Difficulty": "8",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Calves"
            },
            "Single-Leg Glute Bridge": {
                "Equipment": "Barbell",
                "Description": "Lie on your back with knees bent and feet flat, holding a barbell across your hips. Extend one leg straight out, keeping the other foot planted, and lift your hips by squeezing your glutes until your body forms a straight line from shoulders to knees. Focus on engaging the glutes and hamstrings, ensuring the barbell remains stable throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core"
            },
            "Side Plank Hip Abductions": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a side plank position with your elbow directly under your shoulder and your feet stacked. Engage your core and lift your top leg upwards while keeping your body in a straight line, then lower it back down with control. Focus on maintaining stability and balance throughout the movement to effectively target the obliques and hip abductors. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Obliques, Gluteus Medius, Hip Abductors"
            },
            "Single-Leg Calf Raises": {
                "Equipment": "Barbell",
                "Description": "Stand upright with a barbell resting across your upper back, feet hip-width apart. Shift your weight onto one foot, lifting the other slightly off the ground, and raise your heel as high as possible, engaging your calf muscle. Lower your heel back down with control, ensuring your knee remains slightly bent to avoid locking. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Calves, Core, Stabilizers"
            }
        },
        "Push day": {
            "Dumbbell bench press": {
                "Equipment": "Dumbbells",
                "Description": "Lie flat on a bench with a dumbbell in each hand, arms extended above your chest. Lower the dumbbells to the sides of your chest, keeping elbows at a 45-degree angle, then press them back up to the starting position. Focus on engaging your chest, shoulders, and triceps throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Overhead press": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, grip the barbell slightly wider than shoulder-width, and hold it at chest level with palms facing forward. Press the barbell overhead by extending your arms fully, keeping your core engaged and back straight, then lower it back to the starting position. Focus on maintaining a controlled movement to target the shoulders, triceps, and upper chest effectively. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Shoulders, Triceps, Upper Chest"
            },
            "Tricep dips": {
                "Equipment": "Parallette bars",
                "Description": "Begin by sitting on the edge of the parallette bars with your hands gripping the bars beside your hips, fingers pointing forward. Slide off the bars, lowering your body by bending your elbows to a 90-degree angle, keeping your back close to the bars, then push through your palms to return to the starting position. Focus on engaging your triceps throughout the movement, ensuring your shoulders remain down and away from your ears. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Triceps, shoulders, chest"
            },
            "Push-ups": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a high plank position with your hands placed shoulder-width apart and your body forming a straight line from head to heels. Lower your body by bending your elbows until your chest nearly touches the floor, then push back up to the starting position, keeping your core engaged throughout. Focus on maintaining a straight back and avoid letting your hips sag or rise. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Chest, Triceps, Shoulders, Core"
            },
            "Lateral raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. With a slight bend in your elbows, raise your arms out to the sides until they are parallel to the floor, keeping your wrists straight and shoulders down. Focus on engaging the deltoids throughout the movement, then slowly lower the weights back to the starting position. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Deltoids, Trapezius"
            },
            "Skull crushers": {
                "Equipment": "Barbell",
                "Description": "Lie on a flat bench with your feet firmly on the ground, holding a barbell with an overhand grip, arms extended above your chest. Keeping your elbows stationary, lower the barbell towards your forehead by bending your elbows, then extend your arms back to the starting position, focusing on engaging your triceps throughout the movement. Ensure controlled motion to avoid injury and maintain proper form. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Triceps"
            },
            "Chest flyes": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying on a flat bench with a dumbbell in each hand, arms extended above your chest with a slight bend in the elbows. Slowly lower the weights out to the sides in a wide arc until you feel a stretch in your chest, then bring them back to the starting position by squeezing your chest muscles. Focus on maintaining control throughout the movement to effectively target the pectoral muscles. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Arnold press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated or standing with a dumbbell in each hand, palms facing your body at shoulder height. As you press the weights overhead, rotate your palms outward until they face forward at the top of the movement, then reverse the motion back to the start. Focus on controlled movements to engage the shoulders, triceps, and upper chest effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Deltoids, Triceps, Upper Chest"
            },
            "Close-grip bench press": {
                "Equipment": "Barbell",
                "Description": "Lie flat on a bench with feet firmly on the ground, grip the barbell with hands shoulder-width apart, and lift it off the rack. Lower the barbell slowly to your chest, keeping elbows close to your body, then press it back up to the starting position. Focus on engaging the triceps and chest throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Triceps, Chest, Shoulders"
            },
            "Front raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your thighs. Keeping your arms straight, raise the dumbbells in front of you to shoulder height, then slowly lower them back down. Focus on controlled movements to engage the shoulders and avoid swinging. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Deltoids, Trapezius, Serratus Anterior"
            },
            "Tricep kickbacks": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in each hand. Bend slightly at the knees and hinge forward at the hips, keeping your back straight. With elbows bent at 90 degrees and close to your sides, extend your arms backward until fully straightened, focusing on contracting the triceps. Return to the starting position with control. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, Deltoids"
            },
            "Incline bench press": {
                "Equipment": "Barbell",
                "Description": "Lie back on an incline bench set at a 30-45 degree angle, with feet flat on the floor. Grip the barbell slightly wider than shoulder-width apart, lower it to your upper chest while keeping elbows at a 45-degree angle, then press it back up until arms are fully extended. Focus on engaging the upper chest, shoulders, and triceps throughout the movement. \n\nDescription",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Upper chest, shoulders, triceps"
            },
            "Military press": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell at shoulder height with an overhand grip. Press the barbell overhead by extending your arms fully, keeping your core engaged and back straight, then lower it back to the starting position. Focus on maintaining a stable stance and controlled movement to effectively target the shoulders and triceps. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Shoulders, Triceps, Upper Chest"
            },
            "Diamond push-ups": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a plank position with your hands close together, forming a diamond shape with your thumbs and index fingers directly under your chest. Lower your body by bending your elbows, keeping them close to your sides, until your chest nearly touches your hands, then push back up to the starting position. Focus on engaging your triceps, chest, and core throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Triceps, Chest, Core"
            },
            "Reverse flyes": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand, and hinge forward at the hips with a slight bend in the knees. With a slight bend in your elbows, raise the dumbbells out to the sides until your arms are parallel to the floor, squeezing your shoulder blades together, then slowly return to the starting position. Focus on engaging the rear deltoids and upper back muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, upper back, rhomboids"
            },
            "Tricep extensions": {
                "Equipment": "Dumbbells",
                "Description": "Begin by standing or sitting with a dumbbell in each hand, arms extended overhead, and palms facing each other. Keeping your elbows close to your head, lower the dumbbells behind your head by bending your elbows, then extend your arms back to the starting position. Focus on engaging the triceps throughout the movement to ensure proper form and effectiveness. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps"
            },
            "Decline push-ups": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a plank position with your feet elevated on a stable surface, such as a bench or step, and hands placed shoulder-width apart on the ground. Lower your chest towards the floor by bending your elbows, keeping your body in a straight line, then push back up to the starting position. Focus on engaging your chest, shoulders, and triceps throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Shoulder press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated or standing with feet shoulder-width apart, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells upward until your arms are fully extended overhead, then slowly lower them back to the starting position. Focus on engaging the shoulders and maintaining a straight back throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Deltoids, Triceps, Upper Pectorals"
            },
            "Tricep pushdowns": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding the resistance band handles with palms facing down. Anchor the band above you, keeping elbows close to your sides, and extend your arms downward until fully straightened, focusing on squeezing the triceps. Return to the starting position with control, ensuring elbows remain stationary throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Pike push-ups": {
                "Equipment": "Bodyweight",
                "Description": "Begin in a downward dog position with your hands and feet on the ground, hips raised, and body forming an inverted V-shape. Lower your head towards the ground by bending your elbows, keeping them close to your body, then push back up to the starting position. Focus on engaging your shoulders, triceps, and upper chest throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Shoulders, Triceps, Upper Chest"
            },
            "Chest press machine": {
                "Equipment": "Barbell",
                "Description": "Sit on the chest press machine with your back firmly against the pad and feet flat on the floor. Grip the barbell with hands slightly wider than shoulder-width apart, and press it upward until your arms are fully extended, then slowly lower it back to the starting position. Focus on engaging the chest, triceps, and shoulders throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Pectorals, Triceps, Deltoids"
            },
            "Dumbbell shoulder press": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells overhead until your arms are fully extended, then slowly lower them back to the starting position. Focus on engaging your shoulders and maintaining a stable core throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Deltoids, Triceps, Upper Pectorals"
            },
            "Tricep rope pushdowns": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a high anchor point. Stand with feet shoulder-width apart, grasp the band handles with palms facing down, and elbows close to your sides. Push the handles down by extending your elbows until your arms are fully extended, focusing on contracting the triceps, then slowly return to the starting position. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps, forearms"
            },
            "Bench dips": {
                "Equipment": "Parallette bars",
                "Description": "Begin by sitting on the edge of the parallette bars with your hands gripping the bars beside your hips, fingers pointing forward. Slide off the bars, extending your legs forward, and lower your body by bending your elbows to a 90-degree angle, keeping your back close to the bars. Push through your palms to return to the starting position, focusing on engaging your triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, shoulders, chest"
            },
            "Incline dumbbell press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated on an incline bench, holding a dumbbell in each hand at shoulder height with palms facing forward. Press the dumbbells upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging the chest, shoulders, and triceps throughout the movement. Ensure your back remains flat against the bench and avoid locking your elbows at the top. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Shoulder lateral raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Keeping a slight bend in your elbows, raise your arms out to the sides until they are parallel to the floor, then slowly lower them back down. Focus on engaging the deltoids throughout the movement, avoiding any swinging or using momentum. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Deltoids, Trapezius"
            },
            "Tricep overhead extension": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell with both hands, arms extended overhead. Keep your elbows close to your head as you lower the dumbbell behind your head by bending your elbows, then extend your arms back to the starting position. Focus on engaging the triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps, Shoulders"
            },
            "Decline bench press": {
                "Equipment": "Barbell",
                "Description": "Lie on a decline bench with your feet secured and grip the barbell slightly wider than shoulder-width apart. Lower the barbell to your lower chest, keeping your elbows at a 45-degree angle, then press it back up until your arms are fully extended. Focus on engaging your lower pectorals, triceps, and anterior deltoids throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Lower pectorals, triceps, anterior deltoids"
            },
            "Dumbbell front raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing down. Keeping your arms straight but not locked, raise the dumbbells in front of you to shoulder height, then slowly lower them back to the starting position. Focus on engaging the shoulders and maintaining a controlled movement throughout. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius"
            },
            "Tricep bench dips": {
                "Equipment": "Bodyweight",
                "Description": "Sit on the edge of a bench with your hands placed shoulder-width apart, fingers pointing forward, and legs extended with heels on the ground. Lower your body by bending your elbows until your upper arms are parallel to the floor, then push through your palms to return to the starting position, focusing on engaging the triceps throughout the movement. Ensure your back stays close to the bench to avoid shoulder strain. \n\nDescription",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps, Deltoids, Pectorals"
            },
            "Chest press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated on a bench with a dumbbell in each hand, feet flat on the floor. Lie back, holding the dumbbells at chest level with palms facing forward. Press the weights upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging the chest muscles throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Pectorals, triceps, deltoids"
            },
            "Seated military press": {
                "Equipment": "Dumbbells",
                "Description": "Sit upright on a bench with back support, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells overhead until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging your shoulders and maintaining a stable core throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Shoulders, Triceps, Upper Chest"
            },
            "Tricep skull crushers": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest. Keeping your elbows stationary, lower the dumbbells towards your forehead by bending your elbows, then extend your arms back to the starting position. Focus on engaging the triceps throughout the movement. ",
                "Intensity": " 6 ",
                "Difficulty": " 5 ",
                "Muscles": " Triceps"
            },
            "Incline push press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated on an incline bench with your back supported, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging your chest, shoulders, and triceps throughout the movement. Ensure your core is tight to maintain stability and prevent arching of the lower back. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Shoulder shrugs": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Keep your arms straight and lift your shoulders towards your ears, squeezing at the top, then slowly lower back to the starting position. Focus on engaging the trapezius muscles throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "2",
                "Muscles": "Trapezius, Upper Back"
            },
            "Tricep V pushdowns": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a high anchor point and stand facing it, holding the ends with palms facing down. Start with elbows bent at 90 degrees and tucked close to your sides, then extend your arms downward in a V-shape until fully straight, focusing on engaging the triceps. Ensure to keep your core tight and avoid using momentum for a controlled movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps, Shoulders"
            },
            "Reverse grip bench press": {
                "Equipment": "Barbell",
                "Description": "Lie flat on a bench with feet firmly on the ground, grasp the barbell with an underhand grip slightly wider than shoulder-width. Lower the barbell to your chest while keeping elbows close to your body, then press it back up to the starting position, focusing on engaging the triceps and upper chest. Ensure wrists are straight and controlled throughout the movement to prevent strain. \n\nDescription",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Triceps, Upper Chest, Front Deltoids"
            },
            "Dumbbell lateral raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Keeping a slight bend in your elbows, raise your arms out to the sides until they are parallel to the floor, then slowly lower them back down. Focus on engaging your shoulder muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius"
            },
            "Tricep dumbbell kickbacks": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in each hand. Bend slightly at the knees and hinge forward at the hips, keeping your back straight. With elbows bent at 90 degrees and close to your sides, extend your arms backward until fully straightened, focusing on contracting the triceps. Return to the starting position with control. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Decline push press": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a decline bench with your feet secured and hold a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging your chest, shoulders, and triceps throughout the movement. Ensure your back remains flat against the bench and avoid locking your elbows at the top of the press. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Dumbbell chest flyes": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest with a slight bend in the elbows. Slowly lower the dumbbells out to the sides in a wide arc until you feel a stretch in your chest, then bring them back to the starting position by squeezing your chest muscles. Focus on maintaining control throughout the movement to effectively target the pectoral muscles. ",
                "Intensity": " 5 ",
                "Difficulty": " 4 ",
                "Muscles": " Pectorals, Deltoids, Triceps"
            },
            "Shoulder front raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your thighs. Keeping your arms straight but not locked, raise the dumbbells in front of you to shoulder height, then slowly lower them back down. Focus on controlled movements to engage the anterior deltoids effectively. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Anterior deltoids, trapezius, and serratus anterior"
            },
            "Tricep bar pushdowns": {
                "Equipment": "Resistance bands",
                "Description": "Stand upright with feet shoulder-width apart, holding the resistance band handles with an overhand grip. Anchor the band above you, then extend your arms downward, keeping elbows close to your body, until your arms are fully extended, focusing on contracting the triceps. Return to the starting position with control, ensuring elbows remain stationary throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps, shoulders, core"
            },
            "Dumbbell pullovers": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with your upper back and shoulders supported, feet flat on the floor, and hold a dumbbell with both hands above your chest. Keeping your arms slightly bent, lower the dumbbell in an arc behind your head until you feel a stretch in your chest, then return to the starting position by engaging your chest and lats. Focus on maintaining a stable core and controlled movement throughout the exercise. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Lats, Triceps"
            },
            "Seated shoulder press": {
                "Equipment": "Dumbbells",
                "Description": "Sit upright on a bench with back support, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells overhead until your arms are fully extended, then slowly lower them back to the starting position. Focus on keeping your core engaged and avoid arching your back to effectively target the shoulders. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Deltoids, Triceps, Upper Pectorals"
            },
            "Tricep cable pushdowns": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a high anchor point and stand facing it, holding the band with both hands, palms facing down. Keep your elbows close to your sides and extend your arms downward until fully straightened, focusing on squeezing the triceps at the bottom of the movement. Return to the starting position with control, ensuring your elbows remain stationary throughout the exercise. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Chest squeeze press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated or standing with a dumbbell in each hand, elbows bent at 90 degrees, and palms facing each other at chest level. Press the dumbbells together, squeezing your chest muscles, and extend your arms forward until they are fully extended. Return to the starting position, maintaining the squeeze throughout the movement to effectively engage the chest muscles. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Dumbbell arnold press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated or standing with a dumbbell in each hand, palms facing your body at shoulder height. As you press the weights overhead, rotate your palms outward until they face forward at the top of the movement, then reverse the motion to return to the starting position. Focus on controlled movements to engage the shoulders, triceps, and upper chest effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Shoulders, Triceps, Upper Chest"
            },
            "Shoulder rear delt raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand, palms facing each other. Bend slightly at the hips, keeping your back straight, and raise the dumbbells out to the sides until your arms are parallel to the floor, focusing on squeezing the shoulder blades together. Lower the weights back to the starting position with control, ensuring the movement is slow and deliberate to target the rear deltoids effectively. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, upper back, trapezius"
            },
            "Tricep plate extensions": {
                "Equipment": "Weight plates",
                "Description": "Stand with feet shoulder-width apart, holding a weight plate with both hands overhead, arms fully extended. Keeping elbows close to your head, lower the plate behind your head by bending your elbows, then extend your arms back to the starting position. Focus on engaging the triceps throughout the movement, ensuring controlled motion to avoid swinging. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, shoulders, core"
            },
            "Incline dumbbell flyes": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying on an incline bench set at a 30-45 degree angle, holding a dumbbell in each hand with arms extended above your chest, palms facing each other. Lower the dumbbells in a wide arc until you feel a stretch in your chest, keeping a slight bend in your elbows, then bring them back to the starting position by squeezing your chest muscles. Focus on controlled movements to engage the pectoral muscles effectively. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Shoulder upright rows": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your body. Lift the dumbbells vertically, keeping them close to your torso, until elbows are at shoulder height, then lower them back down. Focus on engaging the shoulders and upper back while maintaining a straight posture throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius, Biceps"
            },
            "Tricep single-arm kickbacks": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet hip-width apart, holding a dumbbell in one hand, and hinge forward at the hips with a slight bend in the knees. Keep your back straight and elbow close to your body, extend your arm backward until fully straightened, then return to the starting position. Focus on engaging the triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Dumbbell chest press": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest, palms facing forward. Lower the dumbbells slowly to the sides of your chest, keeping your elbows at a 90-degree angle, then press them back up to the starting position, focusing on engaging your chest muscles. Ensure your feet are flat on the floor and your back remains in contact with the bench throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Pectorals, Triceps, Deltoids"
            },
            "Seated shoulder lateral raises": {
                "Equipment": "Dumbbells",
                "Description": "Sit upright on a bench with feet flat on the floor, holding a dumbbell in each hand at your sides. With a slight bend in your elbows, raise the dumbbells out to the sides until your arms are parallel to the floor, keeping your shoulders down and back. Focus on engaging the deltoids throughout the movement, then slowly lower the weights back to the starting position. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius"
            },
            "Tricep dips with dumbbells": {
                "Equipment": "Dumbbells",
                "Description": "Sit on the edge of a bench or chair with your hands gripping dumbbells placed on either side of your hips, palms facing down. Slide your hips off the bench, keeping your legs extended and feet flat on the floor, then lower your body by bending your elbows to a 90-degree angle, ensuring your elbows point directly behind you. Push through your palms to return to the starting position, focusing on engaging the triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, shoulders, chest"
            },
            "Decline dumbbell press": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a decline bench with your feet secured, holding a dumbbell in each hand above your chest with arms fully extended. Lower the dumbbells slowly to the sides of your chest, keeping your elbows at a 45-degree angle, then press them back up to the starting position, focusing on engaging your chest muscles. Ensure your back remains flat on the bench and avoid locking your elbows at the top. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Pectorals, Triceps, Shoulders"
            },
            "Dumbbell shoulder front raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your thighs. Keeping your core engaged and arms straight, lift the dumbbells in front of you to shoulder height, then slowly lower them back down. Focus on controlled movements to target the anterior deltoids effectively. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Anterior deltoids, trapezius, and serratus anterior"
            },
            "Tricep bench dips with dumbbells": {
                "Equipment": "Dumbbells",
                "Description": "Sit on the edge of a bench with your hands gripping the dumbbells placed on the bench beside your hips, fingers facing forward. Slide your hips off the bench, keeping your legs extended and feet flat on the floor, then lower your body by bending your elbows to a 90-degree angle, ensuring your elbows point straight back, and press back up to the starting position. Focus on engaging the triceps throughout the movement, avoiding any shoulder strain by keeping your shoulders down and away from your ears. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, Deltoids, Pectorals"
            },
            "Chest pullovers": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with your upper back and shoulders supported, feet flat on the floor, and hold a dumbbell with both hands above your chest. Keeping your arms slightly bent, lower the dumbbell in an arc behind your head until you feel a stretch in your chest, then return to the starting position by engaging your chest and lats. Focus on controlled movement to target the chest, lats, and triceps effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Lats, Triceps"
            },
            "Seated shoulder front raises": {
                "Equipment": "Dumbbells",
                "Description": "Sit upright on a bench with feet flat on the floor, holding a dumbbell in each hand with palms facing down. Keeping your back straight and core engaged, raise the dumbbells in front of you to shoulder height, then slowly lower them back to the starting position. Focus on controlled movements to target the anterior deltoids effectively. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Anterior deltoids, trapezius, and serratus anterior"
            },
            "Tricep overhead extensions with dumbbells": {
                "Equipment": "Dumbbells",
                "Description": "Begin by standing or sitting with feet shoulder-width apart, holding a dumbbell with both hands, arms fully extended overhead. Lower the dumbbell behind your head by bending your elbows, keeping your upper arms close to your ears, then extend your arms back to the starting position. Focus on engaging the triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps, Shoulders"
            },
            "Incline dumbbell chest press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated on an incline bench, holding a dumbbell in each hand at shoulder height with palms facing forward. Press the dumbbells upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging your chest muscles throughout the movement. Ensure your feet are flat on the ground and your back remains in contact with the bench to maintain proper form. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Shoulder plate raises": {
                "Equipment": "Weight plates",
                "Description": "Stand with feet shoulder-width apart, holding a weight plate in each hand with arms extended down in front of you. Keeping your core engaged and back straight, raise the plates to shoulder height with a slight bend in the elbows, then lower them back down with control. Focus on engaging the shoulders and upper back throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Deltoids, Trapezius, Upper Back"
            },
            "Tricep kickbacks with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by standing with feet shoulder-width apart, holding the resistance band handles with palms facing inward. Bend slightly at the knees and hinge forward at the hips, keeping your back straight. With elbows tucked close to your sides, extend your arms straight back, squeezing the triceps at the top, then return to the starting position. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps, Deltoids"
            },
            "Dumbbell chest flyes on bench": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest with a slight bend in the elbows. Slowly lower the dumbbells in an arc to the sides until you feel a stretch in your chest, then bring them back to the starting position by squeezing your chest muscles. Focus on controlled movements to engage the pectoral muscles effectively. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Seated shoulder rear delt raises": {
                "Equipment": "Dumbbells",
                "Description": "Sit on the edge of a bench with feet flat on the floor, holding a dumbbell in each hand, palms facing each other. Lean slightly forward at the hips, keeping your back straight, and raise the dumbbells out to the sides until your arms are parallel to the floor, focusing on squeezing the shoulder blades together. Ensure controlled movements to target the rear deltoids effectively. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, upper back, traps"
            },
            "Tricep rope pushdowns with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring the resistance band at a high point, then stand with feet shoulder-width apart, holding the band with both hands. Keep elbows close to your sides and extend your arms downward until fully straightened, focusing on contracting the triceps. Return to the starting position with control, ensuring elbows remain stationary throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps, forearms"
            },
            "Chest cable flyes": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding the resistance bands in each hand, anchored behind you at chest height. Begin with arms extended out to the sides, slightly bent at the elbows, and bring your hands together in front of your chest in a controlled motion, squeezing your chest muscles. Focus on maintaining a slight bend in the elbows throughout the movement to engage the pectoral muscles effectively. \n\nDescription",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Pectorals, Deltoids, Triceps"
            },
            "Dumbbell shoulder lateral raises": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand at your sides. With a slight bend in your elbows, raise your arms out to the sides until they are parallel to the floor, keeping your wrists in line with your shoulders. Focus on engaging your deltoids and avoid swinging or using momentum to lift the weights. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius"
            },
            "Shoulder dumbbell shrugs": {
                "Equipment": "Dumbbells",
                "Description": "Stand upright with feet shoulder-width apart, holding a dumbbell in each hand at your sides. Keeping your arms straight, elevate your shoulders towards your ears, squeezing at the top, then slowly lower them back down. Focus on engaging the trapezius muscles throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "2",
                "Muscles": "Trapezius, Upper Back"
            },
            "Tricep overhead extensions with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by standing with feet shoulder-width apart, holding the resistance band with both hands, and raising your arms overhead. Keep your elbows close to your head as you extend your arms upward, fully straightening them to engage the triceps, then slowly return to the starting position. Focus on maintaining a stable core and controlled movements to effectively target the triceps without straining the shoulders. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Triceps, Shoulders"
            },
            "Incline dumbbell press on bench": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying back on an incline bench set at a 30-45 degree angle, holding a dumbbell in each hand at shoulder height with palms facing forward. Press the dumbbells upward until your arms are fully extended, then slowly lower them back to the starting position, focusing on engaging your chest and shoulders throughout the movement. Ensure your feet are flat on the ground and your back remains in contact with the bench to maintain stability and proper form. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Shoulders, Triceps"
            },
            "Chest dumbbell squeeze press": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying on a flat bench with a dumbbell in each hand, palms facing each other, and arms extended above your chest. Squeeze the dumbbells together as you lower them to your chest, keeping elbows close to your body, then press back up while maintaining the squeeze. Focus on engaging the chest muscles throughout the movement for maximum contraction. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Pectorals, triceps, anterior deltoids"
            },
            "Seated shoulder upright rows": {
                "Equipment": "Dumbbells",
                "Description": "Sit on a bench with feet flat on the floor, holding a dumbbell in each hand with palms facing your body. Keeping your back straight, lift the dumbbells vertically towards your chin, leading with your elbows and keeping them higher than your wrists, then lower them back to the starting position. Focus on engaging your shoulders and upper back throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius, Upper Back"
            },
            "Tricep V pushdowns with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a high anchor point. Stand facing the anchor, grasp the band with both hands, and position your elbows close to your sides. Push the band downwards in a V shape until your arms are fully extended, focusing on engaging the triceps throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Triceps, shoulders, core"
            },
            "Dumbbell pullovers on bench": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with your upper back and shoulders supported, feet flat on the floor, and hold a dumbbell with both hands above your chest. Keeping your arms slightly bent, lower the dumbbell in an arc behind your head until you feel a stretch in your chest, then return to the starting position by engaging your chest and lats. Focus on maintaining a stable core and controlled movement throughout the exercise. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Chest, Lats, Triceps"
            },
            "Shoulder dumbbell arnold press": {
                "Equipment": "Dumbbells",
                "Description": "Begin seated or standing with a dumbbell in each hand, palms facing your body at shoulder height. As you press the weights overhead, rotate your palms outward until they face forward at the top of the movement, then reverse the motion back to the start. Focus on controlled movement to engage the shoulders, triceps, and upper chest effectively. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Deltoids, Triceps, Upper Chest"
            },
            "Tricep cable pushdowns with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a high anchor point. Stand with feet shoulder-width apart, grasp the band with both hands, and position your elbows close to your sides. Push the band down by extending your elbows until your arms are fully straightened, focusing on engaging the triceps, then return to the starting position with control. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Chest dumbbell chest press": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with a dumbbell in each hand, arms extended above your chest, palms facing forward. Lower the dumbbells slowly to the sides of your chest, keeping your elbows at a 90-degree angle, then press them back up to the starting position. Focus on engaging your chest muscles throughout the movement, ensuring a controlled motion without locking your elbows at the top. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Pectorals, Triceps, Deltoids"
            },
            "Seated shoulder plate raises": {
                "Equipment": "Weight plates",
                "Description": "Sit upright on a bench with feet flat on the floor, holding a weight plate in each hand with arms extended down in front of you. Keeping your back straight and core engaged, raise the plates forward to shoulder height, then slowly lower them back to the starting position. Focus on controlled movements to target the shoulders and upper chest. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Deltoids, Trapezius, Upper Chest"
            },
            "Tricep plate extensions with resistance bands": {
                "Equipment": "Resistance bands",
                "Description": "Begin by standing with feet shoulder-width apart, holding the resistance band with both hands overhead, and elbows close to your ears. Slowly lower your forearms behind your head by bending your elbows, then extend your arms back to the starting position, focusing on engaging your triceps throughout the movement. Ensure your core is tight and back straight to maintain proper form. ",
                "Intensity": " 5 ",
                "Difficulty": " 4 ",
                "Muscles": " Triceps, shoulders, core"
            }
        },
        "Pull day": {
            "Pull-up": {
                "Equipment": "Barbell",
                "Description": "To perform a pull-up using a barbell, securely place the barbell on a rack at an appropriate height, grip it with an overhand grip slightly wider than shoulder-width, and hang with arms fully extended. Engage your core and pull your chest towards the barbell by retracting your shoulder blades and bending your elbows, then slowly lower back to the starting position. Focus on maintaining a controlled movement to effectively target the upper back and biceps. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Latissimus dorsi, biceps, rhomboids"
            },
            "Bent-over row": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand. Bend your knees slightly and hinge at the hips, keeping your back straight and core engaged. Pull the dumbbells towards your torso, squeezing your shoulder blades together, then lower them back to the starting position. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Back, Biceps, Shoulders"
            },
            "Chin-up": {
                "Equipment": "Pull-up bars",
                "Description": "Begin by gripping the pull-up bar with an underhand grip, hands shoulder-width apart, and arms fully extended. Engage your core and pull your body upward until your chin is above the bar, focusing on squeezing your shoulder blades together. Lower yourself back to the starting position with control, ensuring full arm extension. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Biceps, Latissimus Dorsi, Rhomboids"
            },
            "Single-arm dumbbell row": {
                "Equipment": "Dumbbells",
                "Description": "Begin by placing your left knee and hand on a bench, keeping your back flat and parallel to the ground. Hold a dumbbell in your right hand, arm extended straight down, then pull the dumbbell towards your hip, keeping your elbow close to your body, and squeeze your shoulder blade at the top. Lower the dumbbell back to the starting position with control, focusing on engaging your back muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, rhomboids, trapezius, biceps"
            },
            "Barbell deadlift": {
                "Equipment": "Barbell",
                "Description": "Stand with feet hip-width apart, toes under the barbell, and grip the bar just outside your knees. Keep your back straight, chest up, and shoulders back as you lift the bar by extending your hips and knees, then lower it back to the ground with control. Focus on engaging your glutes, hamstrings, and lower back throughout the movement. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Glutes, Hamstrings, Lower Back"
            },
            "Seated row": {
                "Equipment": "Cable machine",
                "Description": "Sit on the bench with feet flat on the platform, knees slightly bent, and grasp the cable handle with both hands. Pull the handle towards your torso, keeping your back straight and elbows close to your body, then slowly extend your arms back to the starting position. Focus on engaging your back muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, rhomboids, trapezius, biceps"
            },
            "Face pull": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring the resistance band at upper chest height. Stand facing the anchor point, holding the band with both hands, palms facing down. Pull the band towards your face, keeping elbows high and squeezing the shoulder blades together, focusing on the rear deltoids and upper back. Maintain a neutral spine throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Rear deltoids, trapezius, rhomboids"
            },
            "Hammer curl": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your torso. Keeping your elbows close to your body, curl the weights up by bending your elbows, ensuring your wrists remain neutral and your upper arms stationary. Focus on squeezing the biceps at the top of the movement before slowly lowering the weights back to the starting position. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, Brachialis, Forearms"
            },
            "Wide grip lat pulldown": {
                "Equipment": "Cable machine",
                "Description": "Sit at the cable machine with your thighs secured under the pad and grasp the bar with a wide overhand grip. Pull the bar down towards your upper chest, keeping your elbows pointed down and back, then slowly return to the starting position. Focus on engaging your latissimus dorsi throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, biceps, rhomboids"
            },
            "Reverse flyes": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand, and hinge forward at the hips with a slight bend in the knees. With a slight bend in the elbows, raise the dumbbells out to the sides until your arms are parallel to the floor, squeezing your shoulder blades together, then slowly lower back to the starting position. Focus on engaging the rear deltoids and upper back muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, rhomboids, trapezius"
            },
            "Underhand barbell row": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip, palms facing up. Bend slightly at the knees and hinge at the hips, keeping your back straight, and pull the barbell towards your lower ribcage, squeezing your shoulder blades together. Focus on engaging the lats and biceps while maintaining a stable core throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Lats, Biceps, Rhomboids"
            },
            "Kettlebell swing": {
                "Equipment": "Kettlebells",
                "Description": "Begin with feet shoulder-width apart, holding the kettlebell with both hands in front of you. Hinge at the hips, keeping your back straight, and swing the kettlebell between your legs, then drive your hips forward to swing it up to shoulder height. Focus on engaging your core and glutes throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core, Shoulders"
            },
            "T-bar row": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, knees slightly bent, and hinge at the hips while keeping your back straight. Grasp the barbell with both hands, palms facing down, and pull it towards your chest by squeezing your shoulder blades together, then slowly lower it back down. Focus on engaging the upper back, lats, and biceps throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Upper back, lats, biceps"
            },
            "Inverted row": {
                "Equipment": "Parallette bars",
                "Description": "Begin by lying under the parallette bars with your body straight, arms extended, and heels on the ground. Pull your chest towards the bars by engaging your back and biceps, keeping your elbows close to your body, then slowly lower back to the starting position. Focus on maintaining a straight line from head to heels throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Back, Biceps, Core"
            },
            "Alternating renegade row": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, wrists directly under shoulders, and feet slightly wider than hip-width apart for stability. Keeping your core engaged and hips level, row one dumbbell towards your ribcage by bending the elbow, then lower it back to the ground and repeat on the opposite side. Focus on maintaining a straight line from head to heels and avoid rotating your torso. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Back, Core, Shoulders"
            },
            "Pull-up with knee raise": {
                "Equipment": "Pull-up bars",
                "Description": "Begin by hanging from a pull-up bar with an overhand grip, hands shoulder-width apart, and arms fully extended. Pull your body upward until your chin is above the bar while simultaneously raising your knees toward your chest, engaging your core. Lower yourself back to the starting position in a controlled manner, focusing on your back, biceps, and abdominal muscles. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Latissimus dorsi, biceps, abdominals"
            },
            "Single-arm kettlebell row": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a staggered stance with one foot forward, holding a kettlebell in the opposite hand. Bend slightly at the hips, keeping your back straight, and pull the kettlebell towards your hip, engaging your back muscles, then lower it back down with control. Focus on keeping your core tight and avoid twisting your torso. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, rhomboids, biceps, core"
            },
            "Barbell shrugs": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an overhand grip in front of your thighs. Keep your arms straight and lift your shoulders towards your ears, squeezing at the top, then slowly lower back to the starting position. Focus on engaging the trapezius muscles throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "3",
                "Muscles": "Trapezius, Upper Back"
            },
            "Lying T-bar row": {
                "Equipment": "Barbell",
                "Description": "Lie face down on an incline bench, holding a barbell with an overhand grip. Pull the barbell towards your chest by squeezing your shoulder blades together, keeping elbows close to your body, then slowly lower it back to the starting position. Focus on engaging the upper back and lat muscles throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Upper back, lats, rhomboids"
            },
            "Dumbbell pullover": {
                "Equipment": "Dumbbells",
                "Description": "Lie on a flat bench with your upper back and shoulders supported, feet flat on the floor, and hold a dumbbell with both hands above your chest. Keeping your arms slightly bent, lower the dumbbell in an arc behind your head until you feel a stretch in your chest, then return to the starting position by engaging your chest and lats. Focus on maintaining a stable core and controlled movement throughout the exercise. ",
                "Intensity": " 6 ",
                "Difficulty": " 5 ",
                "Muscles": " Chest, Lats, Triceps"
            },
            "Resistance band pull-aparts": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band with both hands at shoulder height, arms extended in front of you. Pull the band apart by moving your hands outward, keeping your arms straight, until the band touches your chest, then slowly return to the starting position. Focus on engaging the upper back and shoulder muscles throughout the movement. ",
                "Intensity": "3",
                "Difficulty": "3",
                "Muscles": "Upper back, shoulders"
            },
            "L-sit pull-up": {
                "Equipment": "Pull-up bars",
                "Description": "Begin by hanging from the pull-up bar with an overhand grip, arms fully extended, and legs straight out in front of you to form an \"L\" shape. Engage your core and pull yourself up until your chin is above the bar, keeping your legs parallel to the ground throughout the movement. Focus on maintaining a controlled motion to effectively target the upper back, biceps, and core muscles. ",
                "Intensity": "8",
                "Difficulty": "8",
                "Muscles": "Upper back, biceps, core"
            },
            "Iso-lateral row": {
                "Equipment": "Machine",
                "Description": "Sit on the machine with your chest against the pad and feet flat on the floor. Grasp the handles with a neutral grip, keeping your back straight and shoulders down. Pull the handles towards your torso by squeezing your shoulder blades together, then slowly return to the starting position, focusing on engaging your back muscles throughout the movement. ",
                "Intensity": " 5 ",
                "Difficulty": " 3 ",
                "Muscles": " Latissimus dorsi, rhomboids, trapezius, biceps"
            },
            "Kettlebell high pull": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a kettlebell with both hands in front of you. Engage your core, hinge at the hips, and pull the kettlebell upwards towards your chin, keeping elbows higher than wrists, then lower it back down with control. Focus on maintaining a straight back and using your hips and shoulders to drive the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Shoulders, Upper Back, Core, Hips"
            },
            "Barbell curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip, arms fully extended. Curl the barbell towards your chest by bending your elbows, keeping them close to your body, and focus on contracting your biceps. Lower the barbell back to the starting position in a controlled manner, ensuring your back remains straight throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, Forearms"
            },
            "Dumbbell renegade row": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, wrists aligned under shoulders, and feet hip-width apart for stability. Keeping your core engaged and hips level, row one dumbbell towards your ribcage by bending your elbow, then lower it back to the ground and repeat on the other side. Focus on maintaining a stable torso to effectively target the back, shoulders, and core muscles. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Back, Shoulders, Core"
            },
            "Band face pull": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding the resistance band at shoulder height with both hands, palms facing down. Anchor the band at eye level, pull it towards your face by retracting your shoulder blades, keeping elbows high and wide, then slowly return to the starting position. Focus on engaging the rear deltoids and upper back muscles. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Rear deltoids, upper back, traps"
            },
            "Incline dumbbell row": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying face down on an incline bench, holding a dumbbell in each hand with arms extended towards the floor. Pull the dumbbells towards your hips by bending your elbows and squeezing your shoulder blades together, then slowly lower them back to the starting position. Focus on engaging your upper back and lats throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Upper back, lats, biceps"
            },
            "Barbell reverse curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an overhand grip, hands slightly wider than shoulder-width. Keeping elbows close to your body, curl the barbell upwards by flexing your elbows, focusing on the forearms, then slowly lower back to the starting position. Ensure controlled movements to maximize forearm engagement and avoid swinging. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Forearms, Biceps"
            },
            "Kettlebell bent-over row": {
                "Equipment": "Kettlebells",
                "Description": "Stand with feet shoulder-width apart, holding a kettlebell in each hand. Bend at the hips, keeping your back straight and knees slightly bent, then pull the kettlebells towards your waist, squeezing your shoulder blades together. Focus on engaging your back and core muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Back, Biceps, Core"
            },
            "Barbell upright row": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an overhand grip, hands slightly closer than shoulder-width. Pull the barbell vertically towards your chin, keeping elbows higher than wrists, and maintain a straight back throughout the movement. Focus on engaging the shoulders and upper back muscles. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Deltoids, Trapezius, Biceps"
            },
            "Dumbbell hammer curl": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing your torso. Keep your elbows close to your body and curl the weights up by bending your elbows, maintaining the neutral grip throughout the movement. Focus on keeping your upper arms stationary and squeeze your biceps at the top before slowly lowering the weights back to the starting position. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, brachialis, forearms"
            },
            "Resistance band row": {
                "Equipment": "Resistance bands",
                "Description": "Begin seated with legs extended, securing the resistance band around your feet. Hold the band handles with arms extended, palms facing each other. Pull the handles towards your torso, keeping elbows close to your body, and squeeze your shoulder blades together. Focus on engaging your back muscles throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Back, Biceps, Shoulders"
            },
            "Mixed grip chin-up": {
                "Equipment": "Pull-up bars",
                "Description": "Begin by gripping the pull-up bar with one palm facing towards you and the other facing away, hands shoulder-width apart. Engage your core and pull your body upward until your chin is above the bar, then slowly lower back to the starting position. Focus on maintaining a controlled movement to effectively target the biceps, lats, and upper back. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Biceps, Latissimus Dorsi, Upper Back"
            },
            "Single-arm cable row": {
                "Equipment": "Cable machine",
                "Description": "Stand facing the cable machine with feet shoulder-width apart, grasp the handle with one hand, and slightly bend your knees. Pull the handle towards your torso by retracting your shoulder blade and bending your elbow, keeping your back straight and core engaged. Focus on squeezing your back muscles at the end of the movement before slowly returning to the starting position. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Latissimus dorsi, rhomboids, biceps"
            },
            "Kettlebell snatch": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a kettlebell between your legs with one hand. Drive through your hips to swing the kettlebell upward, keeping it close to your body, and punch your hand through at the top to lock out overhead. Focus on explosive hip extension and shoulder stabilization. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Shoulders, Hips, Core"
            },
            "Barbell bent-over row": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an overhand grip. Bend at the hips and knees slightly, keeping your back straight and parallel to the floor. Pull the barbell towards your lower ribcage, squeezing your shoulder blades together, then lower it back down with control. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Back, Biceps, Shoulders"
            },
            "Dumbbell concentration curl": {
                "Equipment": "Dumbbells",
                "Description": "Sit on a bench with your legs spread, holding a dumbbell in one hand. Rest your elbow on the inside of your thigh, keeping your upper arm stationary, and curl the dumbbell towards your shoulder, focusing on contracting the bicep. Lower the dumbbell back to the starting position with control, ensuring full range of motion. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps"
            },
            "Resistance band curl": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band under your feet and gripping the handles with palms facing forward. Keep elbows close to your sides and curl the band upwards by bending your elbows, focusing on contracting your biceps. Slowly lower back to the starting position, ensuring controlled movement throughout. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps"
            },
            "Single-arm lat pulldown": {
                "Equipment": "Cable machine",
                "Description": "Sit at the cable machine with your feet flat on the floor and grasp the handle with one hand, palm facing forward. Pull the handle down towards your chest while keeping your torso upright and your elbow close to your body, then slowly return to the starting position. Focus on engaging your latissimus dorsi throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, biceps, and shoulders"
            },
            "Kettlebell renegade row": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a high plank position with a kettlebell in each hand, ensuring your body forms a straight line from head to heels. Row one kettlebell towards your hip while stabilizing your core and keeping your hips level, then lower it back to the ground and repeat on the other side. Focus on engaging your core, back, and shoulders throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Back, Shoulders"
            },
            "Barbell Zottman curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip. Curl the barbell upward, rotating your wrists to an overhand grip at the top, then lower it slowly, maintaining control. Focus on engaging the biceps and forearms throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Biceps, Forearms"
            },
            "Dumbbell spider curl": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying face down on an incline bench, holding a dumbbell in each hand with arms fully extended towards the floor. Curl the dumbbells upward by bending your elbows, keeping your upper arms stationary, and focus on squeezing your biceps at the top of the movement before slowly lowering back to the starting position. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Biceps"
            },
            "Resistance band face pull": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring the resistance band at upper chest height and stand facing it, holding the band with both hands, palms facing down. Pull the band towards your face, keeping elbows high and squeezing shoulder blades together, focusing on the rear deltoids and upper back. Ensure to maintain a neutral spine and avoid shrugging shoulders during the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Rear deltoids, upper back, trapezius"
            },
            "Single-arm resistance band row": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band at a low anchor point, then stand with feet shoulder-width apart, holding the band in one hand with your arm extended. Pull the band towards your torso by bending your elbow and squeezing your shoulder blade back, keeping your core engaged and torso stable. Focus on maintaining a controlled movement to effectively target the back muscles. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Latissimus dorsi, rhomboids, biceps"
            },
            "Kettlebell single-arm snatch": {
                "Equipment": "Kettlebells",
                "Description": "Begin with your feet shoulder-width apart, holding a kettlebell in one hand between your legs. Explosively drive through your hips and pull the kettlebell upward, keeping it close to your body, then punch your hand through to lock out the kettlebell overhead. Focus on maintaining a straight wrist and a tight core throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Shoulders, Back, Core, Hips"
            },
            "Barbell Pendlay row": {
                "Equipment": "Barbell",
                "Description": "Begin with your feet shoulder-width apart and the barbell on the floor. Bend at the hips and knees, keeping your back flat and parallel to the ground, and grip the barbell with an overhand grip. Pull the barbell towards your lower chest, engaging your back muscles, then lower it back to the floor with control. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Back, Biceps, Core"
            },
            "Dumbbell incline row": {
                "Equipment": "Dumbbells",
                "Description": "Sit on an incline bench with your chest supported and feet firmly on the ground, holding a dumbbell in each hand with a neutral grip. Pull the dumbbells towards your hips by squeezing your shoulder blades together, keeping your elbows close to your body, then slowly lower them back to the starting position. Focus on engaging your upper back and lats throughout the movement. ",
                "Intensity": " 6 ",
                "Difficulty": " 4 ",
                "Muscles": " Upper back, lats, biceps"
            },
            "Resistance band hammer curl": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band under your feet with palms facing each other. Keep elbows close to your sides and curl the bands upward by bending your elbows, focusing on contracting the biceps and forearms. Lower slowly to starting position, ensuring controlled movement throughout. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, Forearms"
            },
            "Kettlebell bottoms-up press": {
                "Equipment": "Kettlebells",
                "Description": "Begin by standing with feet shoulder-width apart, holding a kettlebell in one hand with the bottom facing up at shoulder height. Press the kettlebell overhead by extending your arm fully, keeping your wrist straight and core engaged to maintain balance. Focus on controlled movement to stabilize the shoulder and engage the deltoids, triceps, and core. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Deltoids, Triceps, Core"
            },
            "Barbell reverse grip bent-over row": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip. Bend at the hips, keeping your back straight and knees slightly bent, then pull the barbell towards your lower ribcage, squeezing your shoulder blades together. Focus on engaging the upper back and biceps throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Upper back, biceps, lats"
            },
            "Dumbbell drag curl": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with palms facing forward. Keep elbows close to your sides and drag the dumbbells up by bending your elbows, allowing them to move slightly backward, focusing on squeezing the biceps at the top. Lower the weights back to the starting position in a controlled manner, ensuring the movement is smooth and focused on the biceps. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps"
            },
            "Resistance band tricep extension": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band under your feet or a stable surface, and hold the handles with both hands. Stand upright with your feet shoulder-width apart, extend your arms overhead, and keep your elbows close to your head. Slowly lower your forearms behind your head, then extend your arms back to the starting position, focusing on engaging the triceps throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Triceps"
            },
            "Kettlebell renegade row with push-up": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a high plank position with a kettlebell in each hand, wrists aligned under shoulders, and feet slightly wider than hip-width. Perform a push-up, then row one kettlebell towards your hip while stabilizing your core, alternating sides. Focus on maintaining a straight line from head to heels and engaging the back, chest, and core muscles throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Back, Chest, Core, Shoulders, Triceps"
            },
            "Barbell drag curl": {
                "Equipment": "Barbell",
                "Description": "Stand upright holding a barbell with an underhand grip, arms fully extended and shoulder-width apart. Keeping the elbows close to your sides, drag the barbell up along your torso by lifting your elbows back, focusing on squeezing the biceps at the top. Lower the barbell back down slowly, maintaining control throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Biceps, Forearms"
            },
            "Dumbbell cross body hammer curl": {
                "Equipment": "Dumbbells",
                "Description": "Stand with feet shoulder-width apart, holding a dumbbell in each hand with a neutral grip. Keeping your elbows close to your body, curl the dumbbell across your chest towards the opposite shoulder, focusing on the contraction of the biceps and forearms. Lower the dumbbell back to the starting position in a controlled manner and repeat with the other arm. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, Forearms"
            },
            "Resistance band pull-through": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring a resistance band low behind you and stand with feet shoulder-width apart, holding the band between your legs with both hands. Hinge at the hips, keeping your back straight and knees slightly bent, then drive your hips forward to stand upright, squeezing your glutes at the top. Focus on maintaining tension in the band throughout the movement to effectively target the glutes and hamstrings. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Glutes, Hamstrings, Lower Back"
            },
            "Kettlebell clean and press": {
                "Equipment": "Kettlebells",
                "Description": "Begin with feet shoulder-width apart, holding a kettlebell in one hand between your legs. Initiate the movement by driving through your hips to swing the kettlebell up to shoulder height, then press it overhead, keeping your core engaged and wrist straight. Focus on a smooth transition from the clean to the press, ensuring proper alignment and control throughout. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Shoulders, Core, Glutes, Hamstrings"
            },
            "Barbell spider curl": {
                "Equipment": "Barbell",
                "Description": "Begin by lying face down on an incline bench, holding a barbell with an underhand grip, arms fully extended. Curl the barbell towards your shoulders by flexing your elbows, keeping your upper arms stationary, and focus on squeezing your biceps at the top of the movement before slowly lowering back to the start. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Biceps brachii"
            },
            "Dumbbell renegade row to push-up": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, wrists aligned under shoulders, and feet hip-width apart. Perform a row by pulling one dumbbell towards your ribcage while stabilizing your core, then return it to the ground and repeat with the other arm. After completing the rows, perform a push-up by lowering your chest to the ground and pressing back up, maintaining a straight line from head to heels throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Back, Chest, Core, Shoulders, Triceps"
            },
            "Resistance band face pull with external rotation": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring the resistance band at chest height and grasping the handles with an overhand grip. Stand with feet shoulder-width apart, pull the band towards your face while externally rotating your shoulders, keeping elbows high and squeezing shoulder blades together. Focus on maintaining a straight back and engaging the rear deltoids and upper back muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, upper back, rotator cuff"
            },
            "Kettlebell waiter's carry": {
                "Equipment": "Kettlebells",
                "Description": "Stand upright with feet shoulder-width apart, holding a kettlebell in one hand with your arm fully extended overhead, keeping your wrist straight and core engaged. Walk forward slowly and steadily, maintaining a straight posture and focusing on stabilizing the shoulder and engaging the core throughout the movement. This exercise primarily targets the shoulders, core, and grip strength. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Shoulders, Core, Grip"
            },
            "Barbell reverse preacher curl": {
                "Equipment": "Barbell",
                "Description": "Begin seated at a preacher bench with your upper arms resting on the pad, holding a barbell with an overhand grip, palms facing down. Curl the barbell upwards by bending your elbows, keeping your upper arms stationary, and focus on engaging the forearms and biceps. Lower the barbell back to the starting position in a controlled manner, ensuring full extension of the arms. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Forearms, Biceps"
            },
            "Dumbbell plank row": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, wrists aligned under shoulders, and feet hip-width apart. Engage your core, keep your body straight, and row one dumbbell towards your ribcage while stabilizing with the opposite arm, then alternate sides. Focus on maintaining a stable torso to effectively engage the core, back, and shoulders. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, Back, Shoulders"
            },
            "Resistance band seated row": {
                "Equipment": "Resistance bands",
                "Description": "Sit on the floor with legs extended, loop the resistance band around your feet, and hold the ends with both hands. Keep your back straight, pull the band towards your torso by bending your elbows and squeezing your shoulder blades together, then slowly return to the starting position. Focus on engaging your back muscles and maintaining a neutral spine throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "3",
                "Muscles": "Back, Biceps, Shoulders"
            },
            "Kettlebell windmill": {
                "Equipment": "Kettlebells",
                "Description": "Stand with feet shoulder-width apart, holding a kettlebell in one hand overhead, and the other arm extended downwards. Rotate your torso and hinge at the hips to lower the free hand towards the floor, keeping the kettlebell arm straight and eyes on the weight. Focus on engaging the core, obliques, and shoulders throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Obliques, Shoulders"
            },
            "Barbell hammer curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with a neutral grip (palms facing each other). Keep elbows close to your torso and curl the barbell upward by flexing the elbows, focusing on contracting the biceps and brachialis. Lower the barbell back to the starting position with control, ensuring your upper arms remain stationary throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, brachialis, forearms"
            },
            "Dumbbell prone row": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying face down on an incline bench, holding a dumbbell in each hand with arms extended towards the floor. Pull the dumbbells towards your hips by retracting your shoulder blades and bending your elbows, keeping your elbows close to your body, then slowly lower them back to the starting position. Focus on engaging the upper back and rear shoulder muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Upper back, rear deltoids, biceps"
            },
            "Resistance band bent-over row": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band under your feet and gripping the handles with palms facing each other. Bend at the hips, keeping your back straight and knees slightly bent, then pull the handles towards your waist, squeezing your shoulder blades together. Focus on engaging your back muscles and maintaining a neutral spine throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Back, Biceps, Shoulders"
            },
            "Kettlebell Turkish get-up": {
                "Equipment": "Kettlebells",
                "Description": "Begin by lying on your back with a kettlebell in your right hand, arm extended, and right knee bent. Press the kettlebell up, roll onto your left elbow, then your hand, and push your hips up, sweeping your left leg back into a kneeling position. Stand up fully, then reverse the steps to return to the starting position, focusing on core stability and shoulder control throughout. ",
                "Intensity": "7",
                "Difficulty": "8",
                "Muscles": "Core, Shoulders, Hips"
            },
            "Barbell bicep curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip, arms fully extended. Keep elbows close to your torso and curl the barbell upward by contracting your biceps, then slowly lower it back to the starting position. Focus on controlled movements to maximize bicep engagement and avoid swinging the body. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps"
            },
            "Dumbbell lying row": {
                "Equipment": "Dumbbells",
                "Description": "Lie face down on a flat bench with a dumbbell in each hand, arms extended towards the floor. Pull the dumbbells up towards your hips, keeping elbows close to your body, and squeeze your shoulder blades together at the top. Focus on engaging the upper back and lats throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Upper back, lats, biceps"
            },
            "Resistance band lat pulldown": {
                "Equipment": "Resistance bands",
                "Description": "Begin by securing the resistance band overhead and kneeling or sitting with a straight back. Grasp the band with both hands, palms facing forward, and pull it down towards your chest while squeezing your shoulder blades together, then slowly return to the starting position. Focus on engaging the latissimus dorsi and maintaining controlled movements throughout the exercise. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Latissimus dorsi, biceps, rhomboids"
            },
            "Kettlebell single-arm clean": {
                "Equipment": "Kettlebells",
                "Description": "Begin with feet shoulder-width apart, holding a kettlebell in one hand between your legs. Hinge at the hips, keeping your back straight, and explosively pull the kettlebell up by extending your hips and knees, guiding it to shoulder height with a quick wrist rotation. Focus on engaging your core and maintaining a neutral spine throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core, Shoulders"
            },
            "Barbell reverse grip curl": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip (palms facing up) and arms fully extended. Curl the barbell towards your shoulders by bending your elbows, keeping your upper arms stationary, and focus on squeezing your biceps at the top of the movement. Lower the barbell back to the starting position in a controlled manner, ensuring your wrists remain straight throughout the exercise. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps, Forearms"
            },
            "Dumbbell renegade row to row": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, wrists aligned under shoulders, and feet hip-width apart for stability. Engage your core, row one dumbbell towards your ribcage while keeping your body stable, then lower it back to the ground and repeat with the other arm. Focus on maintaining a straight line from head to heels and avoid rotating your hips. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Back, Core, Shoulders, Arms"
            },
            "Resistance band face pull with Y-raise": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band anchored at chest height. Pull the band towards your face, keeping elbows high, then extend arms overhead into a Y-shape. Focus on engaging the upper back and shoulders throughout the movement. ",
                "Intensity": " 5 ",
                "Difficulty": " 4 ",
                "Muscles": " Upper back, shoulders, rear deltoids"
            },
            "Kettlebell figure 8": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a wide stance with knees slightly bent, holding a kettlebell in one hand. Pass the kettlebell through your legs in a figure 8 motion, switching hands as it moves from front to back, keeping your core engaged and back straight. Focus on maintaining control and stability throughout the movement to effectively target the core, shoulders, and legs. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Core, Shoulders, Legs"
            },
            "Barbell concentration curl": {
                "Equipment": "Barbell",
                "Description": "Sit on a bench with your legs spread, holding a barbell with an underhand grip. Rest your elbow on the inside of your thigh, curl the barbell towards your shoulder while keeping your upper arm stationary, and squeeze your bicep at the top before lowering it back down. Focus on controlled movements to effectively target the biceps. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Biceps"
            },
            "Dumbbell bent-over row to kickback": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a bent-over position with feet shoulder-width apart, holding a dumbbell in each hand, palms facing each other. Pull the dumbbells towards your waist, keeping elbows close to your body, then extend your arms back for the kickback, focusing on squeezing your triceps. Maintain a straight back throughout the movement to engage the back and triceps effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Back, Triceps, Shoulders"
            },
            "Resistance band straight-arm pulldown": {
                "Equipment": "Resistance bands",
                "Description": "Stand with feet shoulder-width apart, holding a resistance band anchored above you with both hands, arms extended straight in front. Pull the band down towards your thighs, keeping arms straight and engaging your lats, then slowly return to the starting position. Focus on maintaining a slight bend in the knees and a neutral spine throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Latissimus dorsi, triceps, core"
            },
            "Kettlebell snatch to lunge": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a kettlebell in one hand. Perform a snatch by explosively lifting the kettlebell overhead while keeping your arm straight, then step back into a lunge with the opposite leg, ensuring your front knee is aligned over your ankle. Focus on engaging your core, shoulders, and legs throughout the movement for stability and control. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Shoulders, Core, Legs"
            },
            "Barbell reverse curl to press": {
                "Equipment": "Barbell",
                "Description": "Begin standing with feet shoulder-width apart, holding a barbell with an overhand grip at thigh level. Curl the barbell upwards by bending your elbows, then transition into a shoulder press by extending your arms overhead. Focus on controlled movements to engage the biceps and shoulders effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Biceps, Shoulders, Forearms"
            },
            "Dumbbell renegade row to kickback": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, ensuring your body forms a straight line from head to heels. Row one dumbbell towards your hip, keeping your elbow close to your body, then extend your arm back into a tricep kickback before returning to the starting position. Focus on engaging your core, back, and triceps throughout the movement, and maintain stability by keeping your hips level. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Core, Back, Triceps"
            },
            "Resistance band face pull with external rotation and Y-raise": {
                "Equipment": "Resistance bands",
                "Description": "Begin by anchoring the resistance band at chest height and hold the ends with an overhand grip. Stand with feet shoulder-width apart, pull the band towards your face while externally rotating your shoulders, then raise your arms into a 'Y' shape overhead. Focus on engaging the rear deltoids, upper back, and rotator cuff muscles throughout the movement. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Rear deltoids, upper back, rotator cuff"
            }
        },
        "Core and cardio": {
            "Plank with shoulder taps": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with a dumbbell in each hand, ensuring your body forms a straight line from head to heels. While maintaining core stability, lift one hand to tap the opposite shoulder, then return it to the dumbbell, alternating sides. Focus on engaging your core, shoulders, and stabilizing muscles to prevent hip rotation. ",
                "Intensity": " 5 ",
                "Difficulty": " 4 ",
                "Muscles": " Core, Shoulders, Stabilizers"
            },
            "Russian twists": {
                "Equipment": "Medicine ball",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a medicine ball with both hands. Lean back slightly, keeping your back straight, and lift your feet off the ground. Rotate your torso to the right, bringing the medicine ball beside your hip, then twist to the left, ensuring your core is engaged throughout the movement. ",
                "Intensity": " 6 ",
                "Difficulty": " 4 ",
                "Muscles": " Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Mountain climbers": {
                "Equipment": "Parallette bars",
                "Description": "Start in a high plank position with hands gripping the parallette bars, ensuring your body forms a straight line from head to heels. Drive one knee towards your chest, then quickly switch legs in a running motion, keeping your core engaged and hips level. Focus on maintaining a steady pace and controlled breathing throughout the exercise. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, shoulders, quadriceps, and hip flexors"
            },
            "Bicycle crunches": {
                "Equipment": "Weight plates",
                "Description": "Lie flat on your back with a weight plate held securely against your chest, legs extended. Lift your shoulders off the ground and bring one knee towards your chest while simultaneously twisting your torso to bring the opposite elbow towards the knee, then switch sides in a pedaling motion. Focus on engaging your core throughout the movement to effectively target the abdominal muscles. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Abdominals, Obliques, Hip Flexors"
            },
            "Dead bug exercise": {
                "Equipment": "Core sliders",
                "Description": "Begin by lying on your back with your arms extended towards the ceiling and your knees bent at 90 degrees, feet off the ground. Place core sliders under your feet, and as you extend one leg forward, slide the foot away while simultaneously lowering the opposite arm overhead, keeping your core engaged and back flat against the floor. Return to the starting position and repeat on the opposite side, focusing on maintaining stability and control throughout the movement. ",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Core, Hip Flexors, Shoulders"
            },
            "Side plank with hip dips": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a side plank position with your forearm on the ground and a kettlebell resting on your hip. Lower your hip towards the ground without touching it, then lift back to the starting position, engaging your obliques throughout the movement. Ensure your body remains in a straight line from head to heels, focusing on controlled movements to maximize core engagement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Shoulders, Glutes"
            },
            "Woodchoppers": {
                "Equipment": "Barbell",
                "Description": "Stand with feet shoulder-width apart, holding a barbell with both hands above one shoulder. Engage your core and rotate your torso, bringing the barbell diagonally across your body to the opposite hip, then return to the starting position. Focus on controlled movements to engage the obliques and core effectively. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Core, Shoulders"
            },
            "Leg raises": {
                "Equipment": "Ankle weights",
                "Description": "Lie flat on your back with your legs extended and ankle weights secured. Engage your core and lift your legs together until they form a 90-degree angle with your torso, keeping them straight. Lower them slowly without touching the ground to maintain tension, focusing on the lower abdominals and hip flexors. ",
                "Intensity": " 6 ",
                "Difficulty": " 4 ",
                "Muscles": " Lower abdominals, hip flexors"
            },
            "Burpees": {
                "Equipment": "Resistance bands",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding the resistance band handles at your sides. Lower into a squat, place the band under your feet, and jump back into a plank position, keeping tension on the band. Jump back to the squat position and explosively jump up, extending your arms overhead, maintaining control of the band throughout. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Full body, with emphasis on legs, core, and shoulders."
            },
            "Jump squats": {
                "Equipment": "Plyo box",
                "Description": "Stand in front of a plyo box with feet shoulder-width apart, lower into a squat, then explosively jump onto the box, landing softly with knees slightly bent. Ensure your core is engaged and chest is up throughout the movement to maintain balance and prevent injury. Step down carefully and repeat, focusing on power and control. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Calves, Core"
            },
            "L-sit pull-ups": {
                "Equipment": "Pull-up bar",
                "Description": "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended, and legs straight out in front of you to form an \"L\" shape. Engage your core and pull your chest towards the bar by bending your elbows, keeping your legs parallel to the ground throughout the movement. Focus on maintaining the L position to target your core, while the pull-up motion engages your back and biceps. ",
                "Intensity": "8",
                "Difficulty": "8",
                "Muscles": "Core, Back, Biceps"
            },
            "Medicine ball slams": {
                "Equipment": "Medicine ball",
                "Description": "Stand with feet shoulder-width apart, holding a medicine ball overhead with both hands. Engage your core and slam the ball down onto the ground with force, bending your knees slightly as you follow through. Focus on using your core, shoulders, and arms to generate power, ensuring a full range of motion. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Core, Shoulders, Arms"
            },
            "Hollow body hold": {
                "Equipment": "Adjustable bench",
                "Description": "Lie on an adjustable bench with your lower back pressed firmly against it, legs extended and arms reaching overhead. Engage your core to lift your shoulders and legs slightly off the bench, creating a hollow shape with your body. Maintain tension in your core throughout the hold, ensuring your lower back stays in contact with the bench. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Core, Hip Flexors, Shoulders"
            },
            "Kettlebell swings": {
                "Equipment": "Kettlebells",
                "Description": "Begin with feet shoulder-width apart, holding the kettlebell with both hands in front of you. Hinge at the hips, keeping your back straight, and swing the kettlebell back between your legs, then thrust your hips forward to swing it up to shoulder height. Focus on engaging your core and glutes throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Glutes, Hamstrings, Core, Shoulders"
            },
            "Plank jacks": {
                "Equipment": "Core sliders",
                "Description": "Begin in a high plank position with your hands under your shoulders and feet on core sliders. Engage your core and slide your feet apart, then back together, maintaining a straight line from head to heels throughout the movement. Focus on keeping your hips stable and avoid letting them sag or rise. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Core, shoulders, glutes"
            },
            "Squat jumps": {
                "Equipment": "Plyo box",
                "Description": "Begin by standing on the ground facing the plyo box with feet shoulder-width apart. Lower into a squat, then explosively jump onto the box, landing softly with knees slightly bent to absorb impact. Focus on engaging your quadriceps, hamstrings, and glutes throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Sit-ups": {
                "Equipment": "Weight plates",
                "Description": "Lie on your back with knees bent and feet flat on the floor, holding a weight plate against your chest. Engage your core to lift your upper body towards your knees, keeping the weight plate steady, then slowly lower back down. Focus on maintaining a controlled movement to effectively target the abdominal muscles. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Abdominals, Hip Flexors"
            },
            "Windshield wipers": {
                "Equipment": "Parallette bars",
                "Description": "Begin by hanging from the parallette bars with your arms fully extended and legs together. Engage your core and lift your legs to a 90-degree angle, then slowly rotate them side to side in a controlled manner, resembling windshield wipers. Focus on maintaining stability and control throughout the movement to effectively target the obliques and lower abs. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Obliques, Lower Abs, Hip Flexors"
            },
            "Russian twists with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Sit on the floor with knees bent and feet flat, holding a medicine ball with both hands. Lean back slightly, keeping your back straight, and lift your feet off the ground. Rotate your torso to the right, bringing the medicine ball beside your hip, then twist to the left, repeating the motion. Focus on engaging your core throughout the exercise. ",
                "Intensity": " 6 ",
                "Difficulty": " 4 ",
                "Muscles": " Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Plank with leg lifts": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a plank position with your forearms resting on dumbbells, ensuring your body forms a straight line from head to heels. Engage your core and glutes as you lift one leg off the ground, keeping it straight, then lower it back down and alternate with the other leg. Focus on maintaining stability and balance throughout the movement to effectively target the core, glutes, and shoulders. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, Glutes, Shoulders"
            },
            "V-ups": {
                "Equipment": "Barbell",
                "Description": "Begin by lying flat on your back, holding a barbell with both hands extended overhead. Simultaneously lift your legs and torso to form a V shape, keeping the barbell aligned with your feet, then slowly lower back to the starting position. Focus on engaging your core throughout the movement to maintain balance and control. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Abdominals, Hip Flexors, Shoulders"
            },
            "Bird dogs": {
                "Equipment": "Core sliders",
                "Description": "Begin in a tabletop position with your hands on core sliders and knees under your hips. Extend your right arm forward and left leg back, keeping your core engaged and hips level, then slide them back to the starting position and switch sides. Focus on maintaining balance and stability throughout the movement to effectively engage the core, glutes, and shoulders. \n\nDescription",
                "Intensity": "4",
                "Difficulty": "3",
                "Muscles": "Core, Glutes, Shoulders"
            },
            "Renegade rows": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a high plank position with a kettlebell in each hand, wrists aligned under shoulders, and feet hip-width apart for stability. Engage your core, row one kettlebell towards your hip while keeping your body stable, then lower it back to the ground and repeat with the other arm. Focus on maintaining a straight line from head to heels and avoid rotating your hips. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Back, Core, Shoulders, Arms"
            },
            "Flutter kicks": {
                "Equipment": "Ankle weights",
                "Description": "Lie on your back with your hands under your glutes, legs extended, and ankle weights secured. Lift your legs slightly off the ground and alternate kicking them up and down in a controlled manner, keeping your core engaged and lower back pressed into the floor. Focus on maintaining a steady pace and avoid arching your back to effectively target the lower abs and hip flexors. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Lower abs, hip flexors, quadriceps"
            },
            "Jumping lunges": {
                "Equipment": "Plyo box",
                "Description": "Begin by standing on the plyo box with feet hip-width apart, then step one foot back into a lunge position, ensuring both knees form 90-degree angles. Explosively jump, switching legs mid-air, and land softly back into a lunge with the opposite leg forward, maintaining balance and control. Focus on engaging the quadriceps, hamstrings, and glutes throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Seated Russian twists": {
                "Equipment": "Weight plates",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a weight plate with both hands. Lean back slightly, keeping your back straight, and engage your core as you rotate your torso to one side, bringing the weight plate beside your hip, then twist to the opposite side. Focus on controlled movements to effectively target the obliques and avoid using momentum. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Reverse crunches": {
                "Equipment": "Parallette bars",
                "Description": "Begin by gripping the parallette bars with your arms extended and your body in a hanging position. Engage your core and lift your knees towards your chest, curling your hips off the bars, then slowly lower back to the starting position. Focus on controlled movements to effectively target the lower abdominals and avoid swinging. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Lower abdominals, hip flexors"
            },
            "Lateral hops": {
                "Equipment": "Adjustable bench",
                "Description": "Stand beside an adjustable bench with feet hip-width apart. Bend your knees slightly and use your arms for momentum as you explosively hop laterally over the bench, landing softly on the opposite side. Focus on maintaining a quick pace while keeping your core engaged and landing with control. ",
                "Intensity": " 6 ",
                "Difficulty": " 5 ",
                "Muscles": " Quadriceps, Calves, Glutes, Core"
            },
            "Plank with knee tucks": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with hands gripping dumbbells directly under shoulders, body forming a straight line from head to heels. Engage your core as you drive one knee towards your chest, then return to starting position and alternate legs, maintaining stability and control throughout. Focus on keeping hips level and avoid sagging or arching your back. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, shoulders, chest, and hip flexors"
            },
            "Scissor kicks": {
                "Equipment": "Ankle weights",
                "Description": "Lie on your back with your hands under your glutes, legs extended, and ankle weights secured. Lift both legs a few inches off the ground, then alternate crossing one leg over the other in a scissor-like motion, keeping your core engaged and lower back pressed into the floor. Focus on controlled movements to effectively target the lower abs and hip flexors. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Lower abs, hip flexors"
            },
            "Bear crawls": {
                "Equipment": "Core sliders",
                "Description": "Begin in a plank position with your hands under your shoulders and feet on core sliders. Engage your core and maintain a flat back as you simultaneously slide your right hand and left foot forward, followed by your left hand and right foot, mimicking a crawling motion. Focus on keeping your hips stable and your movements controlled to effectively engage your core, shoulders, and legs. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, shoulders, quadriceps"
            },
            "Side plank with twist": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a side plank position with your forearm on the ground and feet stacked, holding a medicine ball with your top hand. Rotate your torso to bring the medicine ball under your body, then return to the starting position, focusing on engaging your obliques and core throughout the movement. Ensure your hips remain elevated and aligned with your shoulders for proper form. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Obliques, Core, Shoulders"
            },
            "Box jumps": {
                "Equipment": "Plyo box",
                "Description": "Stand with feet shoulder-width apart, facing the plyo box. Bend your knees slightly, swing your arms, and explosively jump onto the box, landing softly with both feet. Step back down carefully, focusing on engaging your core and leg muscles throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Quadriceps, Glutes, Calves, Core"
            },
            "Leg raises with hip thrusts": {
                "Equipment": "Kettlebells",
                "Description": "Begin by lying on your back with a kettlebell held securely between your feet, legs extended. Lift your legs towards the ceiling, then thrust your hips upward, engaging your core and glutes, before slowly lowering back to the starting position. Ensure controlled movements to maximize core activation and prevent strain. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Hip Flexors, Glutes"
            },
            "Bosu ball planks": {
                "Equipment": "Exercise ball",
                "Description": "Begin in a plank position with your forearms resting on the flat side of a Bosu ball and your feet extended behind you, keeping your body in a straight line from head to heels. Engage your core, glutes, and legs to maintain stability, ensuring your elbows are directly under your shoulders. Focus on maintaining balance and control to effectively target the core muscles. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, shoulders, glutes"
            },
            "Russian twists with kettlebell": {
                "Equipment": "Kettlebells",
                "Description": "Sit on the floor with your knees bent and feet slightly elevated, holding a kettlebell with both hands at chest level. Lean back slightly, engage your core, and rotate your torso to one side, bringing the kettlebell beside your hip, then twist to the opposite side. Maintain a controlled motion and keep your back straight to effectively target the obliques and avoid strain. ",
                "Intensity": " 5 ",
                "Difficulty": " 4 ",
                "Muscles": " Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Plank with row": {
                "Equipment": "Barbell",
                "Description": "Begin in a high plank position with hands gripping a barbell, ensuring your body forms a straight line from head to heels. Engage your core and, while maintaining stability, row the barbell towards your ribcage, alternating sides. Focus on keeping hips level and avoid rotating your torso. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Upper Back, Shoulders"
            },
            "Mountain climbers with sliders": {
                "Equipment": "Core sliders",
                "Description": "Begin in a high plank position with each foot on a core slider, ensuring your body forms a straight line from head to heels. Engage your core and alternate sliding each knee towards your chest in a controlled manner, maintaining a steady pace. Focus on keeping your hips level and your shoulders directly over your wrists throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Core, shoulders, legs"
            },
            "Squat jumps with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a medicine ball close to your chest. Lower into a squat by bending your knees and pushing your hips back, then explosively jump upwards while extending your arms overhead with the ball. Focus on landing softly back into the squat position to engage your quadriceps, glutes, and core. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Core"
            },
            "Hanging leg raises": {
                "Equipment": "Pull-up bar",
                "Description": "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground. Engage your core and, keeping your legs straight, lift them until they are parallel to the ground, then slowly lower them back to the starting position. Focus on maintaining control throughout the movement to effectively target the abdominal muscles. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Abdominals, hip flexors, and obliques"
            },
            "Jump rope": {
                "Equipment": "Plyo box",
                "Description": "Stand on a plyo box with feet together, holding the jump rope handles at your sides. Begin by swinging the rope over your head and jump off the box, landing softly on the ground with knees slightly bent, then immediately jump back onto the box. Focus on maintaining a steady rhythm and engaging your calves, quads, and core throughout the exercise. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Calves, Quads, Core"
            },
            "Plank with toe taps": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a high plank position with hands gripping dumbbells directly under shoulders, feet hip-width apart. Engage your core, maintain a straight line from head to heels, and alternate tapping each foot out to the side while keeping hips stable. Focus on maintaining balance and control to effectively engage the core, shoulders, and glutes. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Core, Shoulders, Glutes"
            },
            "Bicycle crunches with resistance band": {
                "Equipment": "Resistance bands",
                "Description": "Begin by lying on your back with a resistance band looped around your feet, hands behind your head, and legs lifted with knees bent at 90 degrees. Engage your core as you extend your right leg while simultaneously twisting your torso to bring your left elbow towards your right knee, then switch sides in a pedaling motion. Focus on maintaining tension in the band and controlled movements to effectively target the obliques and rectus abdominis. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Medicine ball slams with burpees": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a medicine ball overhead. Slam the ball to the ground with force, then immediately drop into a burpee by placing hands on the ground, jumping feet back into a plank, performing a push-up, and jumping feet forward to stand and repeat. Focus on engaging the core, shoulders, and legs throughout the movement. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Core, Shoulders, Legs"
            },
            "Side plank with leg lifts": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a side plank position with your forearm on the ground and a kettlebell resting on your top hip. Engage your core and lift your top leg while maintaining a straight line from head to heels, ensuring the kettlebell remains stable. Focus on keeping your hips elevated and aligned, targeting the obliques, glutes, and abductors. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Obliques, Glutes, Abductors"
            },
            "Reverse crunches with twist": {
                "Equipment": "Parallette bars",
                "Description": "Begin by gripping the parallette bars with your arms extended and body suspended, legs hanging straight down. Engage your core to lift your knees towards your chest, then twist your hips to one side before returning to the starting position and repeating on the opposite side. Focus on controlled movements to effectively target the obliques and lower abs. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Obliques, Lower Abs, Hip Flexors"
            },
            "L-sit with kettlebell": {
                "Equipment": "Kettlebells",
                "Description": "Begin seated on the floor with legs extended in front of you, holding a kettlebell in each hand. Press the kettlebells into the ground, engage your core, and lift your body off the floor, maintaining a straight line from shoulders to heels. Focus on keeping your legs parallel to the ground and your core tight throughout the hold. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Core, hip flexors, shoulders"
            },
            "Plank with hip twists": {
                "Equipment": "Core sliders",
                "Description": "Begin in a forearm plank position with core sliders under your feet, ensuring your body forms a straight line from head to heels. Engage your core and twist your hips to one side, allowing the sliders to move with your feet, then return to the center and twist to the opposite side. Focus on maintaining a stable upper body and controlled movements to effectively target the obliques and core. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Rectus Abdominis, Transverse Abdominis"
            },
            "Mountain climbers with twist": {
                "Equipment": "Plyo box",
                "Description": "Start in a high plank position with your hands on the plyo box, ensuring your body forms a straight line from head to heels. Drive one knee towards the opposite elbow, twisting your torso slightly, then quickly switch legs in a fluid motion, maintaining a steady pace. Focus on engaging your core and obliques while keeping your shoulders stable and hips low. ",
                "Intensity": "7",
                "Difficulty": "5",
                "Muscles": "Core, Obliques, Shoulders, Quadriceps"
            },
            "V-ups with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Begin by lying flat on your back with legs extended and arms overhead, holding a medicine ball. Simultaneously lift your legs and upper body, reaching the medicine ball towards your feet, forming a \"V\" shape with your body. Focus on engaging your core throughout the movement, ensuring your lower back remains in contact with the ground as you lower back to the starting position. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, hip flexors, and shoulders"
            },
            "Leg raises with twist": {
                "Equipment": "Barbell",
                "Description": "Begin by lying flat on your back, holding a barbell with both hands extended above your chest. Lift your legs towards the ceiling, and as you reach the top, twist your hips to one side, then return to the center before lowering your legs back down. Focus on engaging your core and obliques throughout the movement, ensuring the barbell remains stable. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Obliques, Hip Flexors"
            },
            "Burpees with pull-up bar": {
                "Equipment": "Pull-up bar",
                "Description": "Begin in a standing position under a pull-up bar, drop into a squat, place your hands on the ground, and kick your feet back into a plank. Perform a push-up, then jump your feet back to the squat position, leap up to grab the pull-up bar, and execute a pull-up. Focus on maintaining a strong core throughout the movement and ensure a full range of motion in both the push-up and pull-up phases. ",
                "Intensity": "8",
                "Difficulty": "8",
                "Muscles": "Chest, Back, Core, Shoulders, Arms, Legs"
            },
            "Russian twists with ankle weights": {
                "Equipment": "Ankle weights",
                "Description": "Sit on the floor with your knees bent and feet slightly elevated, wearing ankle weights. Lean back slightly, engage your core, and twist your torso to the right, bringing your hands or a weight to the side of your hip, then twist to the left. Focus on controlled movements to engage the obliques and maintain balance. ",
                "Intensity": " 6 ",
                "Difficulty": " 4 ",
                "Muscles": " Obliques, Rectus Abdominis, Hip Flexors"
            },
            "Jump squats with resistance band": {
                "Equipment": "Resistance bands",
                "Description": "Begin by placing a resistance band just above your knees and stand with feet shoulder-width apart. Lower into a squat by pushing your hips back and bending your knees, keeping your chest up. Explode upwards into a jump, landing softly back into the squat position, ensuring the band remains taut throughout the movement to engage the glutes and thighs. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Hamstrings, Calves"
            },
            "Woodchoppers with weight plates": {
                "Equipment": "Weight plates",
                "Description": "Stand with feet shoulder-width apart, holding a weight plate with both hands. Begin with the plate at one shoulder, then twist your torso and bring the plate diagonally across your body to the opposite hip, engaging your core throughout. Return to the starting position and repeat, focusing on controlled movements to target the obliques and shoulders. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Shoulders, Core"
            },
            "Sit-ups with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Begin by lying on your back with knees bent and feet flat on the floor, holding a medicine ball against your chest. Engage your core and lift your upper body towards your knees, keeping the ball close to your chest, then slowly lower back down to the starting position. Focus on maintaining a controlled movement to effectively target the abdominal muscles. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Abdominals, hip flexors"
            },
            "Flutter kicks with sliders": {
                "Equipment": "Core sliders",
                "Description": "Begin by lying on your back with core sliders under your heels, arms at your sides, and legs extended. Engage your core and lift your legs slightly off the ground, then alternately slide one heel forward while the other slides back, maintaining a fluttering motion. Focus on keeping your lower back pressed into the floor and your core engaged throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "4",
                "Muscles": "Abdominals, hip flexors, lower back"
            },
            "Jumping lunges with kettlebells": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a standing position with feet hip-width apart, holding a kettlebell in each hand at your sides. Step forward into a lunge, ensuring your front knee aligns over your ankle, then explosively jump and switch legs mid-air, landing softly in a lunge on the opposite side. Focus on maintaining core stability and balance throughout the movement to effectively engage the quadriceps, hamstrings, and glutes. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Quadriceps, Hamstrings, Glutes"
            },
            "Seated Russian twists with barbell": {
                "Equipment": "Barbell",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a barbell with both hands in front of your chest. Lean back slightly, engage your core, and rotate your torso to one side, then to the other, keeping the barbell steady and your feet on the ground. Focus on controlled movements to effectively target the obliques and core muscles. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Obliques, Core"
            },
            "Plank jacks with ankle weights": {
                "Equipment": "Ankle weights",
                "Description": "Start in a forearm plank position with ankle weights secured, ensuring your body forms a straight line from head to heels. Jump your feet out to the sides and back together, maintaining a tight core and stable hips throughout the movement. Focus on engaging your core, shoulders, and legs to maintain form and stability. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Shoulders, Legs"
            },
            "Squat jumps with core sliders": {
                "Equipment": "Core sliders",
                "Description": "Begin in a standing position with each foot on a core slider, feet shoulder-width apart. Lower into a squat by bending your knees and pushing your hips back, then explosively jump up while sliding your feet outward, landing softly back into the squat position. Focus on engaging your core and maintaining balance throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Core"
            },
            "Windshield wipers with dumbbells": {
                "Equipment": "Dumbbells",
                "Description": "Begin by lying on your back with arms extended out to the sides, holding a dumbbell in each hand, and legs raised straight up towards the ceiling. Keeping your core engaged, slowly lower your legs to one side while maintaining control, then return to the center and repeat on the opposite side. Focus on maintaining stability in your shoulders and core throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Obliques, Shoulders"
            },
            "Leg raises with resistance band": {
                "Equipment": "Resistance bands",
                "Description": "Begin by lying flat on your back with a resistance band looped around your ankles, keeping your legs straight and arms by your sides. Engage your core and slowly lift your legs towards the ceiling until they form a 90-degree angle with your torso, then lower them back down without touching the ground. Focus on maintaining tension in the band throughout the movement to effectively target the lower abs and hip flexors. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Lower abs, hip flexors"
            },
            "Hollow body hold with kettlebell": {
                "Equipment": "Kettlebells",
                "Description": "Lie on your back holding a kettlebell with both hands above your chest, lift your legs and shoulders off the ground, keeping your lower back pressed into the floor, and hold this position. Ensure your arms are straight and the kettlebell is stable, engaging your core throughout. Focus on maintaining a hollow body shape by keeping your body tight and avoiding arching your back. \n\nDescription",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, Shoulders, Hip Flexors"
            },
            "Kettlebell swings with burpees": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a standing position with feet shoulder-width apart, holding a medicine ball with both hands. Perform a kettlebell swing by hinging at the hips, swinging the ball between your legs, and then explosively driving your hips forward to swing the ball up to shoulder height. Immediately transition into a burpee by placing the ball on the ground, jumping back into a plank, performing a push-up, and then jumping forward to stand and repeat. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Glutes, Hamstrings, Core, Chest, Shoulders"
            },
            "L-sit pull-ups with plyo box": {
                "Equipment": "Plyo box",
                "Description": "Begin by placing a plyo box under a pull-up bar and sit on the box with your legs extended in front of you, forming an \"L\" shape. Grip the bar with an overhand grip, engage your core, and pull yourself up until your chin is above the bar, keeping your legs straight and elevated. Focus on maintaining the \"L\" position throughout the movement to engage your core and upper body effectively. ",
                "Intensity": "8",
                "Difficulty": "8",
                "Muscles": "Core, Back, Biceps"
            },
            "Medicine ball slams with side plank": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a standing position holding a kettlebell with both hands, feet shoulder-width apart. Perform a medicine ball slam by raising the kettlebell overhead and forcefully bringing it down to the side, then transition into a side plank by placing one hand on the ground and extending your body sideways, keeping the kettlebell raised. Focus on engaging your core, shoulders, and obliques throughout the movement. ",
                "Intensity": " 7 ",
                "Difficulty": " 6 ",
                "Muscles": " Core, Shoulders, Obliques"
            },
            "Hanging leg raises with twist": {
                "Equipment": "Parallette bars",
                "Description": "Begin by gripping the parallette bars firmly, hanging with your arms fully extended and legs straight. Engage your core to lift your legs towards your chest, then twist your hips to one side at the top of the movement before lowering them back down with control. Focus on maintaining a steady pace and keeping your core engaged throughout to target the obliques and lower abs effectively. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Obliques, Lower Abs, Hip Flexors"
            },
            "Box jumps with weight plates": {
                "Equipment": "Weight plates",
                "Description": "Begin by standing with feet shoulder-width apart, holding a weight plate close to your chest. Lower into a squat, then explosively jump onto a sturdy box, landing softly with knees slightly bent. Focus on engaging your core and quadriceps throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Quadriceps, Glutes, Calves, Core"
            },
            "Bosu ball planks with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a plank position with forearms resting on a Bosu ball and feet hip-width apart. Place a medicine ball under one hand, maintaining a straight line from head to heels, and engage your core to stabilize. Alternate the medicine ball between hands while keeping hips level to enhance core strength and balance. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, shoulders, chest"
            },
            "Russian twists with row": {
                "Equipment": "Barbell",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a barbell with both hands. Lean back slightly, keeping your back straight, and lift your feet off the ground. Rotate your torso to one side, then the other, while simultaneously pulling the barbell towards your chest in a rowing motion, engaging your core and obliques throughout. ",
                "Intensity": " 7 ",
                "Difficulty": " 6 ",
                "Muscles": " Obliques, Core, Upper Back"
            },
            "Plank with mountain climbers": {
                "Equipment": "Core sliders",
                "Description": "Begin in a high plank position with your hands directly under your shoulders and feet on core sliders. Engage your core and maintain a straight line from head to heels. Alternately slide each knee towards your chest, keeping your hips stable and back flat throughout the movement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, shoulders, hip flexors, and legs"
            },
            "Mountain climbers with leg lifts": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a high plank position with hands gripping kettlebells, ensuring wrists are aligned under shoulders. Drive one knee towards your chest, then extend it back and lift the leg upwards, engaging your core and glutes, before switching legs in a fluid motion. Maintain a steady pace and focus on keeping your body aligned to maximize core, shoulder, and leg engagement. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Core, Shoulders, Glutes, Quadriceps"
            },
            "V-ups with twist": {
                "Equipment": "Barbell",
                "Description": "Begin by lying on your back, holding a barbell with both hands extended overhead. Simultaneously lift your legs and torso off the ground, twisting your torso to one side as you reach the barbell towards your toes, then return to the starting position and repeat on the opposite side. Focus on engaging your core and obliques throughout the movement, ensuring controlled and smooth motions. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Core, Obliques, Hip Flexors"
            },
            "Burpees with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a standing position, holding a medicine ball at chest level. Squat down, placing the ball on the ground, then kick your feet back into a plank position. Perform a push-up, jump your feet back to the squat position, and explosively jump up, lifting the medicine ball overhead. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Quadriceps, Glutes, Core, Shoulders, Chest"
            },
            "Jump rope with plank": {
                "Equipment": "Plyo box",
                "Description": "Begin by standing on a plyo box with a jump rope in hand, then jump off the box while swinging the rope under your feet. Upon landing, immediately transition into a plank position by placing your hands on the floor and extending your legs back, maintaining a straight line from head to heels. Focus on engaging your core and maintaining proper form throughout the exercise. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Calves, Core, Shoulders"
            },
            "Plank with scissor kicks": {
                "Equipment": "Dumbbells",
                "Description": "Begin in a plank position with your hands gripping dumbbells, ensuring your body forms a straight line from head to heels. While maintaining core stability, alternate kicking your legs out to the sides in a controlled scissor motion, keeping your hips steady. Focus on engaging your core, shoulders, and glutes throughout the movement. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, Shoulders, Glutes"
            },
            "Bicycle crunches with leg lifts": {
                "Equipment": "Ankle weights",
                "Description": "Begin by lying flat on your back with your hands behind your head and ankle weights secured. Lift your legs off the ground, bending them at a 90-degree angle. Simultaneously lift your shoulders off the ground and perform a bicycle motion with your legs, bringing your right elbow towards your left knee while extending the right leg, then switch sides. Focus on engaging your core throughout the movement, ensuring a controlled pace to maximize abdominal muscle activation. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Abdominals, Obliques, Hip Flexors"
            },
            "Side plank with bicycle crunches": {
                "Equipment": "Medicine ball",
                "Description": "Begin in a side plank position with your forearm on the ground and feet stacked, holding a medicine ball with your top hand. Engage your core as you bring your top knee towards your chest, simultaneously bringing the medicine ball towards your knee, then return to the starting position. Focus on maintaining a straight line from head to heels and avoid letting your hips drop. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Obliques, Core, Shoulders"
            },
            "Reverse crunches with flutter kicks": {
                "Equipment": "Core sliders",
                "Description": "Begin in a seated position with core sliders under your feet, leaning back slightly with hands on the floor for support. Engage your core as you lift your legs off the ground, performing a reverse crunch by drawing your knees towards your chest, then extend your legs out and perform flutter kicks by alternating small, quick up-and-down movements. Focus on maintaining a tight core throughout to effectively target the lower abs and hip flexors. ",
                "Intensity": "7",
                "Difficulty": "6",
                "Muscles": "Lower abs, hip flexors"
            },
            "L-sit with ankle weights": {
                "Equipment": "Ankle weights",
                "Description": "Sit on the floor with legs extended and ankle weights secured. Place your hands on the ground beside your hips, engage your core, and lift your legs off the floor, keeping them straight to form an \"L\" shape with your body. Focus on maintaining a strong core and straight legs throughout the hold. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Core, Hip Flexors, Quadriceps"
            },
            "Plank with jumping lunges": {
                "Equipment": "Kettlebells",
                "Description": "Begin in a plank position with a kettlebell in each hand, ensuring your body forms a straight line from head to heels. Jump both feet forward into a lunge position, keeping your back straight and core engaged, then jump back to the plank position. Focus on maintaining balance and control throughout the movement to effectively target the core, legs, and shoulders. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Core, Quadriceps, Shoulders"
            },
            "Russian twists with squat jumps": {
                "Equipment": "Plyo box",
                "Description": "Begin in a seated position on the plyo box with your feet flat on the ground, holding a weight or medicine ball with both hands. Perform a Russian twist by rotating your torso to one side, then the other, while keeping your core engaged. Transition into a squat jump by standing up, jumping off the box, and landing softly with knees slightly bent. ",
                "Intensity": "7",
                "Difficulty": "7",
                "Muscles": "Obliques, Core, Quadriceps, Glutes"
            },
            "Leg raises with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Lie flat on your back with your legs extended and hold a medicine ball between your feet. Engage your core and lift your legs, keeping them straight, until they form a 90-degree angle with your torso, then slowly lower them back down without touching the ground. Focus on maintaining control throughout the movement to effectively target the lower abdominals. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Lower abdominals, hip flexors"
            },
            "Sit-ups with resistance band": {
                "Equipment": "Resistance bands",
                "Description": "Begin by lying on your back with your knees bent and feet flat on the floor, securing a resistance band around your feet and holding the ends with both hands. Engage your core as you lift your upper body towards your knees, keeping tension on the band, then slowly lower back to the starting position. Focus on maintaining a controlled movement to effectively target the abdominal muscles. \n\nDescription",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Abdominals, Hip Flexors"
            },
            "Flutter kicks with medicine ball": {
                "Equipment": "Medicine ball",
                "Description": "Lie on your back with a medicine ball held between your feet, legs extended. Engage your core and lift your legs slightly off the ground, then alternate kicking your legs up and down in a fluttering motion, keeping the ball secure. Focus on maintaining a steady pace and keeping your lower back pressed into the floor. ",
                "Intensity": "6",
                "Difficulty": "5",
                "Muscles": "Core, hip flexors, lower abs"
            },
            "Jumping lunges with pull-up bar": {
                "Equipment": "Pull-up bar",
                "Description": "Begin in a standing position under a pull-up bar, grasping it with an overhand grip. Perform a lunge by stepping one foot forward and lowering your hips until both knees are bent at about a 90-degree angle, then explosively jump and switch legs mid-air while simultaneously pulling yourself up towards the bar. Focus on maintaining core stability and controlled movements to engage the quadriceps, hamstrings, glutes, and upper back muscles effectively. ",
                "Intensity": "8",
                "Difficulty": "7",
                "Muscles": "Quadriceps, Hamstrings, Glutes, Upper Back"
            },
            "Seated Russian twists with sliders": {
                "Equipment": "Core sliders",
                "Description": "Sit on the floor with your knees bent and feet flat, holding a core slider in each hand. Lean back slightly, engage your core, and lift your feet off the ground. Rotate your torso to the right, sliding the core slider on the floor beside your hip, then twist to the left, repeating the motion. Maintain a straight back and controlled movement to effectively target the obliques. ",
                "Intensity": "5",
                "Difficulty": "4",
                "Muscles": "Obliques, Rectus Abdominis, Transverse Abdominis"
            }
        }
    }
}